Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/chip_config.svd
<?xml version='1.0' encoding='utf-8'?>
<!-- downloaded from chipselect.org on 05.November 2024 -->
<device xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xmlns:embeetle="https://www.embeetle.com/svd" schemaVersion="1.3" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Geehy</vendor>
  <name>APM32F411</name>
  <version>2024.11.05</version>
  <description>APM32F411</description>
  <cpu>
    <!--ARM Cortex-M4-->
    <name>CM4</name>
    <revision>r1p0</revision>
    <endian>little</endian>
    <nvicPrioBits>3</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <peripherals>
    <peripheral>
      <name>ADC1</name>
      <description>Analog-to-digital converter</description>
      <groupName>ADC</groupName>
      <baseAddress>0x40012000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <interrupt>
        <name>ADC</name>
        <description>ADC1 global interrupt</description>
        <value>18</value>
      </interrupt>
      <registers>
        <register>
          <name>AWDHT</name>
          <displayName>Analog Watchdog High-Threshold Register</displayName>
          <description>Analog watchdog high-threshold register used to define the upper voltage threshold for monitoring analog input signals.</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0xFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AWDHT</name>
              <displayName>Analog Watchdog High Threshold</displayName>
              <description>Specifies the high voltage threshold for the analog watchdog. When the ADC input signal exceeds this threshold, an analog watchdog event is triggered.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  This is a configuration field that defines the high threshold for the
                  analog watchdog. It is set during initialization to establish the
                  monitoring limits.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>AWDLT</name>
          <displayName>Analog Watchdog Low-Threshold Register</displayName>
          <description>Analog watchdog low-threshold register used to define the lower voltage threshold for monitoring analog input signals.</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AWDLT</name>
              <displayName>Analog Watchdog Low Threshold</displayName>
              <description>
                Specifies the low voltage threshold for the analog watchdog. When the
                ADC input signal drops below this threshold, an analog watchdog event
                is triggered.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  This is a configuration field that defines the low threshold for the
                  analog watchdog. It is set during initialization to establish the
                  monitoring limits.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>CCTRL</name>
          <displayName>ADC General-Purpose Control Register</displayName>
          <description>
            General-purpose control register for ADC. This register configures the ADC
            prescaler and enables monitoring of VBAT, temperature sensor, and the internal
            reference voltage.
          </description>
          <addressOffset>0x304</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADCPRE</name>
              <displayName>ADC Prescaler</displayName>
              <description>
                Selects the division factor from PCLK2 to generate the ADC clock. 
                Valid configurations: 00 (PCLK2/2), 01 (PCLK2/4), 
                10 (PCLK2/6), 11 (PCLK2/8).
              </description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV2</name>
                  <displayName>ADC clock = PCLK2/2</displayName>
                  <description>Prescaler divides the PCLK2 by 2.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <displayName>ADC clock = PCLK2/4</displayName>
                  <description>Prescaler divides the PCLK2 by 4.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV6</name>
                  <displayName>ADC clock = PCLK2/6</displayName>
                  <description>Prescaler divides the PCLK2 by 6.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <displayName>ADC clock = PCLK2/8</displayName>
                  <description>Prescaler divides the PCLK2 by 8.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  This is a configuration field that defines the ADC clock prescaler.
                  It is typically set during initialization.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>VBATEN</name>
              <displayName>VBAT Enable</displayName>
              <description>Enable the VBAT channel for ADC measurement.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <displayName>VBAT Disabled</displayName>
                  <description>VBAT measurement is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <displayName>VBAT Enabled</displayName>
                  <description>VBAT measurement is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  This is a configuration field that enables or disables the VBAT channel.
                  Typically set during initialization if VBAT measurement is needed.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>TSVREFEN</name>
              <displayName>Temperature Sensor &amp; VREFINT Enable</displayName>
              <description>Enable the on-chip temperature sensor and internal reference voltage for ADC measurement.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <displayName>Disable Temperature Sensor &amp; VREFINT</displayName>
                  <description>Temperature sensor and VREFINT are disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <displayName>Enable Temperature Sensor &amp; VREFINT</displayName>
                  <description>Temperature sensor and VREFINT are enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  This is a configuration field to enable or disable the internal 
                  temperature sensor and VREFINT. Typically set during initialization 
                  when temperature measurement or internal reference is required.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
