Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/chip_config.svd
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR2_TRGO</name>
                  <displayName>TMR2 TRGO</displayName>
                  <description>Timer 2 TRGO event</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR3_CC1</name>
                  <displayName>TMR3 CC1</displayName>
                  <description>Timer 3 CC1 event</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR3_TRGO</name>
                  <displayName>TMR3 TRGO</displayName>
                  <description>Timer 3 TRGO event</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR4_CC4</name>
                  <displayName>TMR4 CC4</displayName>
                  <description>Timer 4 CC4 event</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR5_CC1</name>
                  <displayName>TMR5 CC1</displayName>
                  <description>Timer 5 CC1 event</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR5_CC2</name>
                  <displayName>TMR5 CC2</displayName>
                  <description>Timer 5 CC2 event</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR5_CC3</name>
                  <displayName>TMR5 CC3</displayName>
                  <description>Timer 5 CC3 event</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR8_CC1</name>
                  <displayName>TMR8 CC1</displayName>
                  <description>Timer 8 CC1 event</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR8_TRGO</name>
                  <displayName>TMR8 TRGO</displayName>
                  <description>Timer 8 TRGO event</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EINT_LINE11</name>
                  <displayName>External Interrupt Line 11</displayName>
                  <description>External pin (EXTI line 11)</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Used to select the desired hardware trigger source for regular 
                  channel conversions.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REGEXTTRGEN</name>
              <displayName>Regular External Trigger Enable</displayName>
              <description>
                Enables or disables the detection edge for the external trigger on 
                regular channels. 00 = disabled, 01 = rising edge, 10 = falling edge, 
                11 = both edges.
              </description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <displayName>Trigger Disabled</displayName>
                  <description>No external trigger detection for regular channels.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <displayName>Rising Edge Trigger</displayName>
                  <description>Trigger on rising edge of selected external signal.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <displayName>Falling Edge Trigger</displayName>
                  <description>Trigger on falling edge of selected external signal.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <displayName>Both Edges Trigger</displayName>
                  <description>Trigger on both rising and falling edges.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configures if and how the ADC detects the external trigger edge
                  for regular conversions.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REGCHSC</name>
              <displayName>Regular Software Start Conversion</displayName>
              <description>
                Software start for regular channels. Writing 1 triggers 
                regular channel conversions if external trigger is disabled 
                or set appropriately.
              </description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_START</name>
                  <displayName>Do Not Start</displayName>
                  <description>No software trigger for regular channels.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START</name>
                  <displayName>Start Regular Conversion</displayName>
                  <description>Start regular channel conversion via software.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  May be used at runtime to manually trigger the regular 
                  channel conversions via software.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>INJDATA1</name>
          <displayName>ADC Injected Data Register 1</displayName>
          <description>
            Holds the converted data of the injected channel(s). Only the lower 16 bits
            are used to store the conversion result; the upper 16 bits are reserved.
          </description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INJDATA</name>
              <displayName>Injected Data</displayName>
              <description>
                Conversion result of the injected channel. Bits [15:0] hold the valid
                data, while the upper 16 bits are reserved.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Read at runtime to obtain the most recent injected channel
                  conversion result.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>INJDATA2</name>
          <displayName>ADC Injected Data Register 2</displayName>
          <description>
            Holds the converted data of the injected channel(s). Only the lower 16 bits
            are used to store the conversion result; the upper 16 bits are reserved.
          </description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INJDATA</name>
              <displayName>Injected Data</displayName>
              <description>
                Conversion result of the injected channel. Bits [15:0] hold the valid
                data, while the upper 16 bits are reserved.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Read at runtime to obtain the most recent injected channel
                  conversion result.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>INJDATA3</name>
          <displayName>ADC Injected Data Register 3</displayName>
          <description>
            Holds the converted data of the injected channel(s). Only the lower 16 bits
            are used to store the conversion result; the upper 16 bits are reserved.
          </description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INJDATA</name>
              <displayName>Injected Data</displayName>
              <description>
                Conversion result of the injected channel. Bits [15:0] hold the valid
                data, while the upper 16 bits are reserved.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Read at runtime to obtain the most recent injected channel
                  conversion result.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>INJDATA4</name>
          <displayName>ADC Injected Data Register 4</displayName>
          <description>
            Holds the converted data of the injected channel(s). Only the lower 16 bits
            are used to store the conversion result; the upper 16 bits are reserved.
          </description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INJDATA</name>
              <displayName>Injected Data</displayName>
              <description>
                Conversion result of the injected channel. Bits [15:0] hold the valid
                data, while the upper 16 bits are reserved.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Read at runtime to obtain the most recent injected channel
                  conversion result.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>INJDOF1</name>
          <displayName>ADC Injected Channel Data Offset Register 1</displayName>
          <description>
            Defines the offset value subtracted from the raw conversion result for
            injected channel 1.
          </description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INJDOF1</name>
              <displayName>Injected Channel 1 Data Offset</displayName>
              <description>
                Data offset for injected channel 1. This 12-bit value is subtracted
                from the raw conversion result before it is stored.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured (if needed) during initialization or calibration
                  to shift the conversion data for injected channel 1.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>INJDOF2</name>
          <displayName>ADC Injected Channel Data Offset Register 2</displayName>
          <description>
            Defines the offset value subtracted from the raw conversion result for
            injected channel 2.
          </description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INJDOF2</name>
              <displayName>Injected Channel 2 Data Offset</displayName>
              <description>
                Data offset for injected channel 2. This 12-bit value is subtracted
                from the raw conversion result before it is stored.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured (if needed) during initialization or calibration
                  to shift the conversion data for injected channel 2.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>INJDOF3</name>
          <displayName>ADC Injected Channel Data Offset Register 3</displayName>
          <description>
            Defines the offset value subtracted from the raw conversion result for
            injected channel 3.
          </description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INJDOF3</name>
              <displayName>Injected Channel 3 Data Offset</displayName>
              <description>
                Data offset for injected channel 3. This 12-bit value is subtracted
                from the raw conversion result before it is stored.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured (if needed) during initialization or calibration
                  to shift the conversion data for injected channel 3.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>INJDOF4</name>
          <displayName>ADC Injected Channel Data Offset Register 4</displayName>
          <description>
            Defines the offset value subtracted from the raw conversion result for
            injected channel 4.
          </description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INJDOF4</name>
              <displayName>Injected Channel 4 Data Offset</displayName>
              <description>
                Data offset for injected channel 4. This 12-bit value is subtracted
                from the raw conversion result before it is stored.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured (if needed) during initialization or calibration
                  to shift the conversion data for injected channel 4.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
