Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/chip_config.svd
        <register>
          <name>INJSEQ</name>
          <displayName>ADC Injected Sequence Register</displayName>
          <description>
            Configures the injected channels sequence and the total number of injected
            conversions (sequence length).
          </description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INJSEQC1</name>
              <displayName>Injected Sequence Channel 1</displayName>
              <description>
                Channel number for the 1st conversion in the injected sequence.
                Valid range: 0-17 (external or internal ADC channels).
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured during initialization to select which channel is converted
                  first in the injected sequence (if sequence length >= 4).
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>INJSEQC2</name>
              <displayName>Injected Sequence Channel 2</displayName>
              <description>
                Channel number for the 2nd conversion in the injected sequence.
                Valid range: 0-17 (external or internal ADC channels).
              </description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured during initialization to select which channel is converted
                  second in the injected sequence (if sequence length >= 3).
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>INJSEQC3</name>
              <displayName>Injected Sequence Channel 3</displayName>
              <description>
                Channel number for the 3rd conversion in the injected sequence.
                Valid range: 0-17 (external or internal ADC channels).
              </description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured during initialization to select which channel is converted
                  third in the injected sequence (if sequence length >= 2).
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>INJSEQC4</name>
              <displayName>Injected Sequence Channel 4</displayName>
              <description>
                Channel number for the 4th conversion in the injected sequence.
                Valid range: 0-17 (external or internal ADC channels).
              </description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured during initialization to select which channel is converted
                  fourth in the injected sequence (if sequence length >= 1).
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>INJSEQLEN</name>
              <displayName>Injected Sequence Length</displayName>
              <description>
                Specifies how many conversions are performed in the injected sequence.
              </description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONE</name>
                  <displayName>1 Conversion</displayName>
                  <description>
                    Sequence performs only 1 conversion: INJSEQ4
                  </description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO</name>
                  <displayName>2 Conversions</displayName>
                  <description>
                    Sequence performs INJSEQ3 → INJSEQ4
                  </description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE</name>
                  <displayName>3 Conversions</displayName>
                  <description>
                    Sequence performs INJSEQ2 → INJSEQ3 → INJSEQ4
                  </description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR</name>
                  <displayName>4 Conversions</displayName>
                  <description>
                    Sequence performs INJSEQ1 → INJSEQ2 → INJSEQ3 → INJSEQ4
                  </description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Set during initialization to define how many injected 
                  conversions occur and in which order.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>REGDATA</name>
          <displayName>ADC Regular Data Register</displayName>
          <description>
            Holds the conversion data of the regular channels. In single-ADC mode, only
            the lower 16 bits are used for the ADC data. In dual-ADC mode, the upper
            16 bits store the conversion data of the second ADC.
          </description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REGDATA</name>
              <displayName>Regular Data</displayName>
              <description>
                Conversion result of the regular channel(s). In single-ADC mode, bits
                [15:0] hold the ADC data. In dual-ADC mode, bits [15:0] hold ADC1 data
                and bits [31:16] hold ADC2 data.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Read at runtime to obtain the most recent result from the 
                  regular channel(s). In dual-ADC mode, additional data is 
                  stored in the upper 16 bits.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>REGSEQ1</name>
          <displayName>ADC Regular Sequence Register 1</displayName>
          <description>
            Configures the 13ᵗʰ to 16ᵗʰ channels in the regular conversion sequence,
            as well as the total length of the regular sequence.
          </description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REGSEQC13</name>
              <displayName>13th Conversion Channel</displayName>
              <description>
                Channel number for the 13th conversion in the regular sequence.
                Valid range: 0-17 (external or internal ADC channels).
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured during initialization to select which channel 
                  is converted 13th in the regular sequence.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REGSEQC14</name>
              <displayName>14th Conversion Channel</displayName>
              <description>
                Channel number for the 14th conversion in the regular sequence.
                Valid range: 0-17.
              </description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured to select which channel is converted 14th 
                  in the regular sequence.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REGSEQC15</name>
              <displayName>15th Conversion Channel</displayName>
              <description>
                Channel number for the 15th conversion in the regular sequence.
                Valid range: 0-17.
              </description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured to select which channel is converted 15th 
                  in the regular sequence.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REGSEQC16</name>
              <displayName>16th Conversion Channel</displayName>
              <description>
                Channel number for the 16th conversion in the regular sequence.
                Valid range: 0-17.
              </description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured to select which channel is converted 16th 
                  in the regular sequence.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REGSEQLEN</name>
              <displayName>Regular Channel Sequence Length</displayName>
              <description>
                Specifies the total number of conversions in the regular sequence.
              </description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONE</name>
                  <displayName>1 Conversion</displayName>
                  <description>The regular sequence has 1 channel.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO</name>
                  <displayName>2 Conversions</displayName>
                  <description>The regular sequence has 2 channels.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE</name>
                  <displayName>3 Conversions</displayName>
                  <description>The regular sequence has 3 channels.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR</name>
                  <displayName>4 Conversions</displayName>
                  <description>The regular sequence has 4 channels.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIVE</name>
                  <displayName>5 Conversions</displayName>
                  <description>The regular sequence has 5 channels.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIX</name>
                  <displayName>6 Conversions</displayName>
                  <description>The regular sequence has 6 channels.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEVEN</name>
                  <displayName>7 Conversions</displayName>
                  <description>The regular sequence has 7 channels.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT</name>
                  <displayName>8 Conversions</displayName>
                  <description>The regular sequence has 8 channels.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NINE</name>
                  <displayName>9 Conversions</displayName>
                  <description>The regular sequence has 9 channels.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN</name>
                  <displayName>10 Conversions</displayName>
                  <description>The regular sequence has 10 channels.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ELEVEN</name>
                  <displayName>11 Conversions</displayName>
                  <description>The regular sequence has 11 channels.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWELVE</name>
                  <displayName>12 Conversions</displayName>
                  <description>The regular sequence has 12 channels.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THIRTEEN</name>
                  <displayName>13 Conversions</displayName>
                  <description>The regular sequence has 13 channels.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOURTEEN</name>
                  <displayName>14 Conversions</displayName>
                  <description>The regular sequence has 14 channels.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFTEEN</name>
                  <displayName>15 Conversions</displayName>
                  <description>The regular sequence has 15 channels.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIXTEEN</name>
                  <displayName>16 Conversions</displayName>
                  <description>The regular sequence has 16 channels.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured during initialization to define how many channels 
                  are in the regular conversion sequence.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>REGSEQ2</name>
          <displayName>ADC Regular Sequence Register 2</displayName>
          <description>
            Configures the 7ᵗʰ to 12ᵗʰ channels in the regular conversion sequence.
          </description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REGSEQC7</name>
              <displayName>7th Conversion Channel</displayName>
              <description>
                Channel number for the 7th conversion in the regular sequence.
                Valid range: 0-17.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured during initialization to select which channel
                  is converted 7th in the regular sequence.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REGSEQC8</name>
              <displayName>8th Conversion Channel</displayName>
              <description>
                Channel number for the 8th conversion in the regular sequence.
                Valid range: 0-17.
              </description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured during initialization to select which channel
                  is converted 8th in the regular sequence.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REGSEQC9</name>
              <displayName>9th Conversion Channel</displayName>
              <description>
                Channel number for the 9th conversion in the regular sequence.
                Valid range: 0-17.
              </description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured to select which channel is converted 9th 
                  in the regular sequence.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REGSEQC10</name>
              <displayName>10th Conversion Channel</displayName>
              <description>
                Channel number for the 10th conversion in the regular sequence.
                Valid range: 0-17.
              </description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured to select which channel is converted 10th 
                  in the regular sequence.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REGSEQC11</name>
              <displayName>11th Conversion Channel</displayName>
              <description>
                Channel number for the 11th conversion in the regular sequence.
                Valid range: 0-17.
              </description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured to select which channel is converted 11th 
                  in the regular sequence.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REGSEQC12</name>
              <displayName>12th Conversion Channel</displayName>
              <description>
                Channel number for the 12th conversion in the regular sequence.
                Valid range: 0-17.
              </description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured to select which channel is converted 12th 
                  in the regular sequence.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
