Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/chip_config.svd
        <register>
          <name>REGSEQ3</name>
          <displayName>ADC Regular Sequence Register 3</displayName>
          <description>
            Configures the 1ˢᵗ to 6ᵗʰ channels in the regular conversion sequence.
          </description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REGSEQC1</name>
              <displayName>1st Conversion Channel</displayName>
              <description>
                Channel number for the 1st conversion in the regular sequence.
                Valid range: 0-17.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Set which channel is converted 1st in the regular sequence.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REGSEQC2</name>
              <displayName>2nd Conversion Channel</displayName>
              <description>
                Channel number for the 2nd conversion in the regular sequence.
                Valid range: 0-17.
              </description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Set which channel is converted 2nd in the regular sequence.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REGSEQC3</name>
              <displayName>3rd Conversion Channel</displayName>
              <description>
                Channel number for the 3rd conversion in the regular sequence.
                Valid range: 0-17.
              </description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Set which channel is converted 3rd in the regular sequence.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REGSEQC4</name>
              <displayName>4th Conversion Channel</displayName>
              <description>
                Channel number for the 4th conversion in the regular sequence.
                Valid range: 0-17.
              </description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Set which channel is converted 4th in the regular sequence.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REGSEQC5</name>
              <displayName>5th Conversion Channel</displayName>
              <description>
                Channel number for the 5th conversion in the regular sequence.
                Valid range: 0-17.
              </description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Set which channel is converted 5th in the regular sequence.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REGSEQC6</name>
              <displayName>6th Conversion Channel</displayName>
              <description>
                Channel number for the 6th conversion in the regular sequence.
                Valid range: 0-17.
              </description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Set which channel is converted 6th in the regular sequence.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPTIM1</name>
          <displayName>ADC Sampling Time Register 1</displayName>
          <description>
            Configures the sample times for ADC channels 0 to 9. Each channel is assigned
            a 3-bit field, indicating the number of ADC clock cycles used for sampling.
          </description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMPCYCCFG1</name>
              <displayName>Sample Time Configuration 1</displayName>
              <description>
                SMPCYCCFG1 covers multiple channels (channels 0..9, 3 bits each = 30 bits),
                but here it's only 27 bits in total. The chapter indicates 8 or 10 channels
                per register, etc. This is a summary of possible arrangement.
                SMPCYCCFG1 holds the sample time configurations (3 bits per channel) for
                multiple ADC channels. Each 3-bit field defines the number of cycles for
                sampling:
                000 = 3 cycles,
                001 = 15 cycles,
                010 = 28 cycles,
                011 = 56 cycles,
                100 = 84 cycles,
                101 = 112 cycles,
                110 = 144 cycles,
                111 = 480 cycles.
                Note: Only 27 bits are used here (9 channels x 3 bits).
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>27</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Typically set during initialization to configure each channel's
                  sampling time for channels covered by SMPTIM1.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPTIM2</name>
          <displayName>ADC Sampling Time Register 2</displayName>
          <description>
            Configures the sample times for additional ADC channels (e.g. 10 to 17). Each
            channel is assigned a 3-bit field, indicating the number of ADC clock cycles
            used for sampling.
          </description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <!--  -->
            <field>
              <name>SMPCYCCFG2</name>
              <displayName>Sample Time Configuration 2</displayName>
              <description>
                SMPCYCCFG2 covers more channels with 3 bits each. According to the chapter,
                30 bits might be enough for 10 channels.
                SMPCYCCFG2 holds the sample time configurations (3 bits per channel) for
                additional ADC channels. Each 3-bit field defines the number of cycles for
                sampling:
                000 = 3 cycles,
                001 = 15 cycles,
                010 = 28 cycles,
                011 = 56 cycles,
                100 = 84 cycles,
                101 = 112 cycles,
                110 = 144 cycles,
                111 = 480 cycles.
                Note: 30 bits used here (10 channels x 3 bits).
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Typically set during initialization to configure each channel's
                  sampling time for channels covered by SMPTIM2.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>STS</name>
          <displayName>ADC Status Register</displayName>
          <description>
            Reports various ADC status flags such as analog watchdog event, end of
            conversion for both regular and injected channels, start flags, and
            overrun detection.
          </description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AWDFLG</name>
              <displayName>Analog Watchdog Flag</displayName>
              <description>
                Indicates whether an analog watchdog event has occurred (voltage out
                of the configured thresholds).
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Cleared by software after handling the watchdog event.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>EOCFLG</name>
              <displayName>End of Conversion Flag (Regular)</displayName>
              <description>
                Indicates whether a regular channel conversion has completed.
              </description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Typically cleared by reading the ADC data register or by
                  software in the ISR.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>INJEOCFLG</name>
              <displayName>End of Conversion Flag (Injected)</displayName>
              <description>
                Indicates whether an injected channel conversion has completed.
              </description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Typically cleared by reading the injected data registers or
                  by software in the ISR.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>INJCSFLG</name>
              <displayName>Injected Channel Start Flag</displayName>
              <description>
                Indicates whether an injected channel conversion has started.
              </description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Can be used to monitor if the ADC began injected channel conversion.
                  Cleared by hardware when the conversion ends or by software.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REGCSFLG</name>
              <displayName>Regular Channel Start Flag</displayName>
              <description>
                Indicates whether a regular channel conversion has started.
              </description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Can be used to monitor if the ADC began regular channel conversion.
                  Cleared by hardware when the conversion ends or by software.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>OVRFLG</name>
              <displayName>Overrun Flag</displayName>
              <description>
                Indicates an overrun event occurred (new data overwritten before
                previous data was read).
              </description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Typically cleared by software after acknowledging the overrun.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
