Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/chip_config.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC2</name>
      <description>Analog-to-digital converter</description>
      <groupName>ADC</groupName>
      <baseAddress>0x40012400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <registers>
        <register>
          <name>AWDHT</name>
          <displayName>Analog Watchdog High-Threshold Register</displayName>
          <description>Analog watchdog high-threshold register used to define the upper voltage threshold for monitoring analog input signals.</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0xFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AWDHT</name>
              <displayName>Analog Watchdog High Threshold</displayName>
              <description>Specifies the high voltage threshold for the analog watchdog. When the ADC input signal exceeds this threshold, an analog watchdog event is triggered.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  This is a configuration field that defines the high threshold for the
                  analog watchdog. It is set during initialization to establish the
                  monitoring limits.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>AWDLT</name>
          <displayName>Analog Watchdog Low-Threshold Register</displayName>
          <description>Analog watchdog low-threshold register used to define the lower voltage threshold for monitoring analog input signals.</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AWDLT</name>
              <displayName>Analog Watchdog Low Threshold</displayName>
              <description>
                Specifies the low voltage threshold for the analog watchdog. When the
                ADC input signal drops below this threshold, an analog watchdog event
                is triggered.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  This is a configuration field that defines the low threshold for the
                  analog watchdog. It is set during initialization to establish the
                  monitoring limits.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL1</name>
          <displayName>ADC Control Register 1</displayName>
          <description>
            ADC control register 1. Configures the analog watchdog channel selection, 
            various interrupts, scan mode, discontinuous mode, resolution, and other 
            important ADC operating parameters.
          </description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AWDCHSEL</name>
              <displayName>Analog Watchdog Channel Select</displayName>
              <description>
                Selects the ADC channel to be monitored by the analog watchdog.
                Valid values range from 0 to 16. Other values are reserved.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH0</name>
                  <displayName>Channel 0</displayName>
                  <description>Monitor ADC analog input channel 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1</name>
                  <displayName>Channel 1</displayName>
                  <description>Monitor ADC analog input channel 1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH2</name>
                  <displayName>Channel 2</displayName>
                  <description>Monitor ADC analog input channel 2.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH3</name>
                  <displayName>Channel 3</displayName>
                  <description>Monitor ADC analog input channel 3.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH4</name>
                  <displayName>Channel 4</displayName>
                  <description>Monitor ADC analog input channel 4.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH5</name>
                  <displayName>Channel 5</displayName>
                  <description>Monitor ADC analog input channel 5.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH6</name>
                  <displayName>Channel 6</displayName>
                  <description>Monitor ADC analog input channel 6.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH7</name>
                  <displayName>Channel 7</displayName>
                  <description>Monitor ADC analog input channel 7.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH8</name>
                  <displayName>Channel 8</displayName>
                  <description>Monitor ADC analog input channel 8.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH9</name>
                  <displayName>Channel 9</displayName>
                  <description>Monitor ADC analog input channel 9.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH10</name>
                  <displayName>Channel 10</displayName>
                  <description>Monitor ADC analog input channel 10.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH11</name>
                  <displayName>Channel 11</displayName>
                  <description>Monitor ADC analog input channel 11.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH12</name>
                  <displayName>Channel 12</displayName>
                  <description>Monitor ADC analog input channel 12.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH13</name>
                  <displayName>Channel 13</displayName>
                  <description>Monitor ADC analog input channel 13.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH14</name>
                  <displayName>Channel 14</displayName>
                  <description>Monitor ADC analog input channel 14.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH15</name>
                  <displayName>Channel 15</displayName>
                  <description>Monitor ADC analog input channel 15.</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH16</name>
                  <displayName>Channel 16</displayName>
                  <description>Monitor ADC analog input channel 16.</description>
                  <value>16</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  This field is typically set during initialization to configure which
                  channel is monitored by the ADC's analog watchdog.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>EOCIEN</name>
              <displayName>End-of-Conversion Interrupt Enable</displayName>
              <description>
                Enables or disables the interrupt when a regular channel conversion is 
                complete.
              </description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <displayName>Interrupt Disabled</displayName>
                  <description>EOC interrupt is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <displayName>Interrupt Enabled</displayName>
                  <description>EOC interrupt is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Typically set during initialization to enable or disable the EOC 
                  interrupt.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>AWDIEN</name>
              <displayName>Analog Watchdog Interrupt Enable</displayName>
              <description>
                Enables or disables the interrupt when the analog watchdog detects that 
                the input signal has crossed the threshold boundaries.
              </description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <displayName>Interrupt Disabled</displayName>
                  <description>Watchdog interrupt is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <displayName>Interrupt Enabled</displayName>
                  <description>Watchdog interrupt is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured during initialization if analog watchdog events should
                  trigger an interrupt.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>INJEOCIEN</name>
              <displayName>Injected End-of-Conversion Interrupt Enable</displayName>
              <description>
                Enables or disables the interrupt when an injected channel conversion 
                completes.
              </description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <displayName>Interrupt Disabled</displayName>
                  <description>Injected EOC interrupt is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <displayName>Interrupt Enabled</displayName>
                  <description>Injected EOC interrupt is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Typically enabled if the application needs to handle injected channel
                  conversions via interrupt.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>SCANEN</name>
              <displayName>Scan Mode Enable</displayName>
              <description>
                Enables or disables scan mode for regular or injected channel sequences.
              </description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <displayName>Scan Mode Disabled</displayName>
                  <description>Single channel or single conversion mode operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <displayName>Scan Mode Enabled</displayName>
                  <description>Scans through multiple channels in a sequence.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured during initialization to specify whether multiple channels
                  should be converted in a sequence.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>AWDSGLEN</name>
              <displayName>Watchdog Single Channel Enable in Scan Mode</displayName>
              <description>
                When set, the analog watchdog monitors only a single channel (selected by 
                AWDCHSEL) in scan mode. Otherwise, it monitors all channels in the scan.
              </description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALLCHANNELS</name>
                  <displayName>All Channels</displayName>
                  <description>Analog watchdog monitors all channels in scan mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLECHANNEL</name>
                  <displayName>Single Channel</displayName>
                  <description>
                    Analog watchdog monitors only the channel defined by AWDCHSEL.
                  </description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Set during initialization if only one channel is to be monitored by
                  the watchdog in scan mode.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>INJGACEN</name>
              <displayName>Automatic Injected Group Conversion Enable</displayName>
              <description>
                When set, the ADC automatically starts the injected group conversion
                after the regular group conversion completes.
              </description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <displayName>Disable Auto Injected Conversion</displayName>
                  <description>Injected group conversions are triggered manually or by an external source.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <displayName>Enable Auto Injected Conversion</displayName>
                  <description>Automatic injected conversion starts after a regular conversion sequence completes.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured if the system design requires automatic injection after 
                  regular conversions.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REGDISCEN</name>
              <displayName>Discontinuous Mode on Regular Channels Enable</displayName>
              <description>
                Enables or disables discontinuous mode on the regular channel sequence.
              </description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <displayName>Disable Discontinuous Mode</displayName>
                  <description>Regular channels operate in normal (continuous or single) scan mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <displayName>Enable Discontinuous Mode</displayName>
                  <description>Regular channels are converted in smaller sub-groups triggered each time.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Set when the application requires partial (sub-group) conversions of 
                  the regular channels, rather than one full sequence at once.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>INJDISCEN</name>
              <displayName>Discontinuous Mode on Injected Channels Enable</displayName>
              <description>
                Enables or disables discontinuous mode on the injected channel sequence.
              </description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <displayName>Disable Discontinuous Mode</displayName>
                  <description>Injected channels operate in normal (full) injected scan mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <displayName>Enable Discontinuous Mode</displayName>
                  <description>Injected channels are converted in smaller sub-groups triggered each time.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Set when the application needs partial (sub-group) conversions of 
                  the injected channels.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DISCNUMCFG</name>
              <displayName>Discontinuous Mode Channel Count</displayName>
              <description>
                Specifies the number of channels in each discontinuous group for regular 
                channel conversions. 000 = 1 channel, 001 = 2 channels, ... 111 = 8 channels.
              </description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONE</name>
                  <displayName>1 Channel</displayName>
                  <description>Each sub-group conversion has 1 channel.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO</name>
                  <displayName>2 Channels</displayName>
                  <description>Each sub-group conversion has 2 channels.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE</name>
                  <displayName>3 Channels</displayName>
                  <description>Each sub-group conversion has 3 channels.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR</name>
                  <displayName>4 Channels</displayName>
                  <description>Each sub-group conversion has 4 channels.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIVE</name>
                  <displayName>5 Channels</displayName>
                  <description>Each sub-group conversion has 5 channels.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIX</name>
                  <displayName>6 Channels</displayName>
                  <description>Each sub-group conversion has 6 channels.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEVEN</name>
                  <displayName>7 Channels</displayName>
                  <description>Each sub-group conversion has 7 channels.</description>
                  <value>6</value>
