Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/chip_config.svd
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT</name>
                  <displayName>8 Channels</displayName>
                  <description>Each sub-group conversion has 8 channels.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Set during initialization to define how many channels are converted 
                  on each trigger in discontinuous mode.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>INJAWDEN</name>
              <displayName>Analog Watchdog on Injected Channels Enable</displayName>
              <description>
                When set, the analog watchdog function is applied to the injected 
                channels as well.
              </description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <displayName>Injected Watchdog Disabled</displayName>
                  <description>Analog watchdog does not monitor injected channels.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <displayName>Injected Watchdog Enabled</displayName>
                  <description>Analog watchdog monitors injected channels.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configure if the injected channels should also be guarded by 
                  the analog watchdog.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REGAWDEN</name>
              <displayName>Analog Watchdog on Regular Channels Enable</displayName>
              <description>
                When set, the analog watchdog function is applied to the regular 
                channels.
              </description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <displayName>Regular Watchdog Disabled</displayName>
                  <description>Analog watchdog does not monitor regular channels.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <displayName>Regular Watchdog Enabled</displayName>
                  <description>Analog watchdog monitors regular channels.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configure if the regular channels should be guarded by 
                  the analog watchdog.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>RESSEL</name>
              <displayName>Resolution Selection</displayName>
              <description>
                Configures the ADC resolution. 00 = 12-bit, 01 = 10-bit, 
                10 = 8-bit, 11 = 6-bit.
              </description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RES12</name>
                  <displayName>12-bit Resolution</displayName>
                  <description>ADC operates at 12-bit resolution.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES10</name>
                  <displayName>10-bit Resolution</displayName>
                  <description>ADC operates at 10-bit resolution.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES8</name>
                  <displayName>8-bit Resolution</displayName>
                  <description>ADC operates at 8-bit resolution.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES6</name>
                  <displayName>6-bit Resolution</displayName>
                  <description>ADC operates at 6-bit resolution.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Set during initialization to choose the ADC's resolution 
                  for conversions.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>OVRIEN</name>
              <displayName>Overrun Interrupt Enable</displayName>
              <description>
                Enables or disables the interrupt when an overrun occurs. An overrun
                occurs if new data overwrites old data in the data register before it 
                is read.
              </description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <displayName>Interrupt Disabled</displayName>
                  <description>Overrun interrupt is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <displayName>Interrupt Enabled</displayName>
                  <description>Overrun interrupt is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Typically enabled if the application needs to handle data overrun 
                  events with an interrupt.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
