Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/chip_config.svd
        <register>
          <name>CTRL2</name>
          <displayName>ADC Control Register 2</displayName>
          <description>
            ADC control register 2. Configures ADC enable, single/continuous operation,
            DMA behavior, data alignment, external triggers for regular and injected
            conversions, and software start triggers.
          </description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADCEN</name>
              <displayName>ADC Enable</displayName>
              <description>
                Enables or disables the ADC. 0 = ADC in power-down mode, 
                1 = ADC enabled.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <displayName>ADC Disabled</displayName>
                  <description>The ADC is powered down and no conversions occur.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <displayName>ADC Enabled</displayName>
                  <description>The ADC is enabled and ready for conversions.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Typically changed at runtime to turn the ADC on or off. 
                  However, often set once during initialization.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>CONTCEN</name>
              <displayName>Continuous Conversion Enable</displayName>
              <description>
                Selects single or continuous conversion mode. 0 = single conversion, 
                1 = continuous conversion.
              </description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <displayName>Single Conversion</displayName>
                  <description>The ADC performs only one conversion per trigger.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTINUOUS</name>
                  <displayName>Continuous Conversion</displayName>
                  <description>The ADC performs back-to-back conversions after a start.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Typically set during initialization depending on whether the 
                  application requires continuous sampling or single-shot conversions.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DMAEN</name>
              <displayName>DMA Mode Enable</displayName>
              <description>
                Enables or disables DMA requests when regular conversions complete 
                (in single ADC mode).
              </description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <displayName>DMA Disabled</displayName>
                  <description>No DMA requests are generated after conversion completes.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <displayName>DMA Enabled</displayName>
                  <description>DMA requests are generated to transfer conversion results.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Enabled if the application wants automatic data transfers from 
                  ADC to memory without CPU intervention.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DMADISSEL</name>
              <displayName>DMA Disable Selection</displayName>
              <description>
                Specifies how DMA requests are generated when DMA is enabled 
                (in single ADC mode).
              </description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONESHOT</name>
                  <displayName>One-Shot DMA</displayName>
                  <description>No further DMA requests after the last completed transmission.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONT</name>
                  <displayName>Continuous DMA</displayName>
                  <description>DMA requests continue whenever data conversion occurs.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Depending on the application's data handling approach, configure 
                  if DMA stops after a single series of transfers or continues indefinitely.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>EOCSEL</name>
              <displayName>End-of-Conversion Selection</displayName>
              <description>
                Selects when the EOC flag is set.
              </description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ</name>
                  <displayName>EOC After Sequence</displayName>
                  <description>EOC flag is set once per entire conversion sequence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EACH</name>
                  <displayName>EOC After Each Conversion</displayName>
                  <description>EOC flag is set after each channel conversion within the sequence.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Chosen based on how frequently the application wants to be notified 
                  of conversion completions.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DALIGNCFG</name>
              <displayName>Data Alignment Configuration</displayName>
              <description>
                Selects the alignment of ADC conversion data.
              </description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RIGHT</name>
                  <displayName>Right Alignment</displayName>
                  <description>Converted data is right-aligned in the ADC data register.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEFT</name>
                  <displayName>Left Alignment</displayName>
                  <description>Converted data is left-aligned in the ADC data register.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Typically configured once during initialization to match the 
                  data handling approach of the application.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>INJGEXTTRGSEL</name>
              <displayName>Injected External Trigger Selection</displayName>
              <description>
                Selects the external event to start the injected group conversion.
                Refer to Table 130 in the reference manual for possible trigger sources.
              </description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <!-- Table 130 from chapter -->
                <enumeratedValue>
                  <name>TMR1_CC4</name>
                  <displayName>TMR1 CC4</displayName>
                  <description>Timer 1 CC4 event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR1_TRGO</name>
                  <displayName>TMR1 TRGO</displayName>
                  <description>Timer 1 TRGO event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR2_CC1</name>
                  <displayName>TMR2 CC1</displayName>
                  <description>Timer 2 CC1 event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR2_TRGO</name>
                  <displayName>TMR2 TRGO</displayName>
                  <description>Timer 2 TRGO event</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR3_CC2</name>
                  <displayName>TMR3 CC2</displayName>
                  <description>Timer 3 CC2 event</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR3_CC4</name>
                  <displayName>TMR3 CC4</displayName>
                  <description>Timer 3 CC4 event</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR4_CC1</name>
                  <displayName>TMR4 CC1</displayName>
                  <description>Timer 4 CC1 event</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR4_CC2</name>
                  <displayName>TMR4 CC2</displayName>
                  <description>Timer 4 CC2 event</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR4_CC3</name>
                  <displayName>TMR4 CC3</displayName>
                  <description>Timer 4 CC3 event</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR4_TRGO</name>
                  <displayName>TMR4 TRGO</displayName>
                  <description>Timer 4 TRGO event</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR5_CC4</name>
                  <displayName>TMR5 CC4</displayName>
                  <description>Timer 5 CC4 event</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR5_TRGO</name>
                  <displayName>TMR5 TRGO</displayName>
                  <description>Timer 5 TRGO event</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR8_CC2</name>
                  <displayName>TMR8 CC2</displayName>
                  <description>Timer 8 CC2 event</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR8_CC3</name>
                  <displayName>TMR8 CC3</displayName>
                  <description>Timer 8 CC3 event</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR8_CC4</name>
                  <displayName>TMR8 CC4</displayName>
                  <description>Timer 8 CC4 event</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EINT_LINE15</name>
                  <displayName>External Interrupt Line 15</displayName>
                  <description>External pin (EXTI line 15)</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Used to select the desired hardware trigger source for injected 
                  channel conversions.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>INJEXTTRGEN</name>
              <displayName>Injected External Trigger Enable</displayName>
              <description>
                Enables or disables the detection edge for the external trigger on 
                injected channels.
              </description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <displayName>Trigger Disabled</displayName>
                  <description>No external trigger detection for injected channels.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <displayName>Rising Edge Trigger</displayName>
                  <description>Trigger on rising edge of selected external signal.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <displayName>Falling Edge Trigger</displayName>
                  <description>Trigger on falling edge of selected external signal.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <displayName>Both Edges Trigger</displayName>
                  <description>Trigger on both rising and falling edges.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configure if and how the ADC detects the external trigger edge
                  for injected conversions.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>INJSWSC</name>
              <displayName>Injected Software Start Conversion</displayName>
              <description>
                Software start for injected channels. Writing 1 triggers 
                injected channel conversions if external trigger is disabled 
                or set appropriately.
              </description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_START</name>
                  <displayName>Do Not Start</displayName>
                  <description>No software trigger for injected channels.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START</name>
                  <displayName>Start Injected Conversion</displayName>
                  <description>Start injected channels conversion via software.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  May be used at runtime to manually trigger the injected 
                  channel conversions via software.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REGEXTTRGSEL</name>
              <displayName>Regular External Trigger Selection</displayName>
              <description>
                Selects the external event to start the regular channel conversion.
                Refer to Table 129 in the reference manual for possible trigger sources.
              </description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <!-- Table 129 from chapter: -->
                <enumeratedValue>
                  <name>TMR1_CC1</name>
                  <displayName>TMR1 CC1</displayName>
                  <description>Timer 1 CC1 event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR1_CC2</name>
                  <displayName>TMR1 CC2</displayName>
                  <description>Timer 1 CC2 event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR1_CC3</name>
                  <displayName>TMR1 CC3</displayName>
                  <description>Timer 1 CC3 event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR2_CC2</name>
                  <displayName>TMR2 CC2</displayName>
                  <description>Timer 2 CC2 event</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR2_CC3</name>
                  <displayName>TMR2 CC3</displayName>
                  <description>Timer 2 CC3 event</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR2_CC4</name>
                  <displayName>TMR2 CC4</displayName>
                  <description>Timer 2 CC4 event</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR2_TRGO</name>
                  <displayName>TMR2 TRGO</displayName>
                  <description>Timer 2 TRGO event</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR3_CC1</name>
                  <displayName>TMR3 CC1</displayName>
                  <description>Timer 3 CC1 event</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR3_TRGO</name>
                  <displayName>TMR3 TRGO</displayName>
                  <description>Timer 3 TRGO event</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR4_CC4</name>
                  <displayName>TMR4 CC4</displayName>
                  <description>Timer 4 CC4 event</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR5_CC1</name>
                  <displayName>TMR5 CC1</displayName>
                  <description>Timer 5 CC1 event</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR5_CC2</name>
                  <displayName>TMR5 CC2</displayName>
                  <description>Timer 5 CC2 event</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR5_CC3</name>
                  <displayName>TMR5 CC3</displayName>
                  <description>Timer 5 CC3 event</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR8_CC1</name>
                  <displayName>TMR8 CC1</displayName>
                  <description>Timer 8 CC1 event</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR8_TRGO</name>
                  <displayName>TMR8 TRGO</displayName>
                  <description>Timer 8 TRGO event</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EINT_LINE11</name>
                  <displayName>External Interrupt Line 11</displayName>
                  <description>External pin (EXTI line 11)</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Used to select the desired hardware trigger source for regular 
                  channel conversions.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REGEXTTRGEN</name>
              <displayName>Regular External Trigger Enable</displayName>
              <description>
                Enables or disables the detection edge for the external trigger on 
                regular channels. 00 = disabled, 01 = rising edge, 10 = falling edge, 
                11 = both edges.
              </description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <displayName>Trigger Disabled</displayName>
