Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/chip_config.svd
                  <description>No external trigger detection for regular channels.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <displayName>Rising Edge Trigger</displayName>
                  <description>Trigger on rising edge of selected external signal.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <displayName>Falling Edge Trigger</displayName>
                  <description>Trigger on falling edge of selected external signal.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <displayName>Both Edges Trigger</displayName>
                  <description>Trigger on both rising and falling edges.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configures if and how the ADC detects the external trigger edge
                  for regular conversions.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REGCHSC</name>
              <displayName>Regular Software Start Conversion</displayName>
              <description>
                Software start for regular channels. Writing 1 triggers 
                regular channel conversions if external trigger is disabled 
                or set appropriately.
              </description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_START</name>
                  <displayName>Do Not Start</displayName>
                  <description>No software trigger for regular channels.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START</name>
                  <displayName>Start Regular Conversion</displayName>
                  <description>Start regular channel conversion via software.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  May be used at runtime to manually trigger the regular 
                  channel conversions via software.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>INJDATA1</name>
          <displayName>ADC Injected Data Register 1</displayName>
          <description>
            Holds the converted data of the injected channel(s). Only the lower 16 bits
            are used to store the conversion result; the upper 16 bits are reserved.
          </description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INJDATA</name>
              <displayName>Injected Data</displayName>
              <description>
                Conversion result of the injected channel. Bits [15:0] hold the valid
                data, while the upper 16 bits are reserved.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Read at runtime to obtain the most recent injected channel
                  conversion result.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>INJDATA2</name>
          <displayName>ADC Injected Data Register 2</displayName>
          <description>
            Holds the converted data of the injected channel(s). Only the lower 16 bits
            are used to store the conversion result; the upper 16 bits are reserved.
          </description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INJDATA</name>
              <displayName>Injected Data</displayName>
              <description>
                Conversion result of the injected channel. Bits [15:0] hold the valid
                data, while the upper 16 bits are reserved.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Read at runtime to obtain the most recent injected channel
                  conversion result.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>INJDATA3</name>
          <displayName>ADC Injected Data Register 3</displayName>
          <description>
            Holds the converted data of the injected channel(s). Only the lower 16 bits
            are used to store the conversion result; the upper 16 bits are reserved.
          </description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INJDATA</name>
              <displayName>Injected Data</displayName>
              <description>
                Conversion result of the injected channel. Bits [15:0] hold the valid
                data, while the upper 16 bits are reserved.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Read at runtime to obtain the most recent injected channel
                  conversion result.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>INJDATA4</name>
          <displayName>ADC Injected Data Register 4</displayName>
          <description>
            Holds the converted data of the injected channel(s). Only the lower 16 bits
            are used to store the conversion result; the upper 16 bits are reserved.
          </description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INJDATA</name>
              <displayName>Injected Data</displayName>
              <description>
                Conversion result of the injected channel. Bits [15:0] hold the valid
                data, while the upper 16 bits are reserved.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Read at runtime to obtain the most recent injected channel
                  conversion result.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>INJDOF1</name>
          <displayName>ADC Injected Channel Data Offset Register 1</displayName>
          <description>
            Defines the offset value subtracted from the raw conversion result for
            injected channel 1.
          </description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INJDOF1</name>
              <displayName>Injected Channel 1 Data Offset</displayName>
              <description>
                Data offset for injected channel 1. This 12-bit value is subtracted
                from the raw conversion result before it is stored.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured (if needed) during initialization or calibration
                  to shift the conversion data for injected channel 1.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>INJDOF2</name>
          <displayName>ADC Injected Channel Data Offset Register 2</displayName>
          <description>
            Defines the offset value subtracted from the raw conversion result for
            injected channel 2.
          </description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INJDOF2</name>
              <displayName>Injected Channel 2 Data Offset</displayName>
              <description>
                Data offset for injected channel 2. This 12-bit value is subtracted
                from the raw conversion result before it is stored.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured (if needed) during initialization or calibration
                  to shift the conversion data for injected channel 2.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>INJDOF3</name>
          <displayName>ADC Injected Channel Data Offset Register 3</displayName>
          <description>
            Defines the offset value subtracted from the raw conversion result for
            injected channel 3.
          </description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INJDOF3</name>
              <displayName>Injected Channel 3 Data Offset</displayName>
              <description>
                Data offset for injected channel 3. This 12-bit value is subtracted
                from the raw conversion result before it is stored.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured (if needed) during initialization or calibration
                  to shift the conversion data for injected channel 3.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>INJDOF4</name>
          <displayName>ADC Injected Channel Data Offset Register 4</displayName>
          <description>
            Defines the offset value subtracted from the raw conversion result for
            injected channel 4.
          </description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INJDOF4</name>
              <displayName>Injected Channel 4 Data Offset</displayName>
              <description>
                Data offset for injected channel 4. This 12-bit value is subtracted
                from the raw conversion result before it is stored.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured (if needed) during initialization or calibration
                  to shift the conversion data for injected channel 4.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>INJSEQ</name>
          <displayName>ADC Injected Sequence Register</displayName>
          <description>
            Configures the injected channels sequence and the total number of injected
            conversions (sequence length).
          </description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INJSEQC1</name>
              <displayName>Injected Sequence Channel 1</displayName>
              <description>
                Channel number for the 1st conversion in the injected sequence.
                Valid range: 0-17 (external or internal ADC channels).
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured during initialization to select which channel is converted
                  first in the injected sequence (if sequence length >= 4).
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>INJSEQC2</name>
              <displayName>Injected Sequence Channel 2</displayName>
              <description>
                Channel number for the 2nd conversion in the injected sequence.
                Valid range: 0-17 (external or internal ADC channels).
              </description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured during initialization to select which channel is converted
                  second in the injected sequence (if sequence length >= 3).
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>INJSEQC3</name>
              <displayName>Injected Sequence Channel 3</displayName>
              <description>
                Channel number for the 3rd conversion in the injected sequence.
                Valid range: 0-17 (external or internal ADC channels).
              </description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured during initialization to select which channel is converted
                  third in the injected sequence (if sequence length >= 2).
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>INJSEQC4</name>
              <displayName>Injected Sequence Channel 4</displayName>
              <description>
                Channel number for the 4th conversion in the injected sequence.
                Valid range: 0-17 (external or internal ADC channels).
              </description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured during initialization to select which channel is converted
                  fourth in the injected sequence (if sequence length >= 1).
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>INJSEQLEN</name>
              <displayName>Injected Sequence Length</displayName>
              <description>
                Specifies how many conversions are performed in the injected sequence.
              </description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONE</name>
                  <displayName>1 Conversion</displayName>
                  <description>
                    Sequence performs only 1 conversion: INJSEQ4
                  </description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO</name>
                  <displayName>2 Conversions</displayName>
                  <description>
                    Sequence performs INJSEQ3 → INJSEQ4
                  </description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE</name>
                  <displayName>3 Conversions</displayName>
                  <description>
                    Sequence performs INJSEQ2 → INJSEQ3 → INJSEQ4
                  </description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR</name>
                  <displayName>4 Conversions</displayName>
                  <description>
                    Sequence performs INJSEQ1 → INJSEQ2 → INJSEQ3 → INJSEQ4
                  </description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Set during initialization to define how many injected 
                  conversions occur and in which order.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>REGDATA</name>
          <displayName>ADC Regular Data Register</displayName>
          <description>
            Holds the conversion data of the regular channels. In single-ADC mode, only
            the lower 16 bits are used for the ADC data. In dual-ADC mode, the upper
            16 bits store the conversion data of the second ADC.
          </description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REGDATA</name>
              <displayName>Regular Data</displayName>
              <description>
                Conversion result of the regular channel(s). In single-ADC mode, bits
                [15:0] hold the ADC data. In dual-ADC mode, bits [15:0] hold ADC1 data
                and bits [31:16] hold ADC2 data.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Read at runtime to obtain the most recent result from the 
                  regular channel(s). In dual-ADC mode, additional data is 
                  stored in the upper 16 bits.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
