Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/chip_config.svd
        <register>
          <name>REGSEQ1</name>
          <displayName>ADC Regular Sequence Register 1</displayName>
          <description>
            Configures the 13ᵗʰ to 16ᵗʰ channels in the regular conversion sequence,
            as well as the total length of the regular sequence.
          </description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REGSEQC13</name>
              <displayName>13th Conversion Channel</displayName>
              <description>
                Channel number for the 13th conversion in the regular sequence.
                Valid range: 0-17 (external or internal ADC channels).
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured during initialization to select which channel 
                  is converted 13th in the regular sequence.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REGSEQC14</name>
              <displayName>14th Conversion Channel</displayName>
              <description>
                Channel number for the 14th conversion in the regular sequence.
                Valid range: 0-17.
              </description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured to select which channel is converted 14th 
                  in the regular sequence.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REGSEQC15</name>
              <displayName>15th Conversion Channel</displayName>
              <description>
                Channel number for the 15th conversion in the regular sequence.
                Valid range: 0-17.
              </description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured to select which channel is converted 15th 
                  in the regular sequence.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REGSEQC16</name>
              <displayName>16th Conversion Channel</displayName>
              <description>
                Channel number for the 16th conversion in the regular sequence.
                Valid range: 0-17.
              </description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured to select which channel is converted 16th 
                  in the regular sequence.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REGSEQLEN</name>
              <displayName>Regular Channel Sequence Length</displayName>
              <description>
                Specifies the total number of conversions in the regular sequence.
              </description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONE</name>
                  <displayName>1 Conversion</displayName>
                  <description>The regular sequence has 1 channel.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO</name>
                  <displayName>2 Conversions</displayName>
                  <description>The regular sequence has 2 channels.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE</name>
                  <displayName>3 Conversions</displayName>
                  <description>The regular sequence has 3 channels.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR</name>
                  <displayName>4 Conversions</displayName>
                  <description>The regular sequence has 4 channels.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIVE</name>
                  <displayName>5 Conversions</displayName>
                  <description>The regular sequence has 5 channels.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIX</name>
                  <displayName>6 Conversions</displayName>
                  <description>The regular sequence has 6 channels.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEVEN</name>
                  <displayName>7 Conversions</displayName>
                  <description>The regular sequence has 7 channels.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT</name>
                  <displayName>8 Conversions</displayName>
                  <description>The regular sequence has 8 channels.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NINE</name>
                  <displayName>9 Conversions</displayName>
                  <description>The regular sequence has 9 channels.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN</name>
                  <displayName>10 Conversions</displayName>
                  <description>The regular sequence has 10 channels.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ELEVEN</name>
                  <displayName>11 Conversions</displayName>
                  <description>The regular sequence has 11 channels.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWELVE</name>
                  <displayName>12 Conversions</displayName>
                  <description>The regular sequence has 12 channels.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THIRTEEN</name>
                  <displayName>13 Conversions</displayName>
                  <description>The regular sequence has 13 channels.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOURTEEN</name>
                  <displayName>14 Conversions</displayName>
                  <description>The regular sequence has 14 channels.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFTEEN</name>
                  <displayName>15 Conversions</displayName>
                  <description>The regular sequence has 15 channels.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIXTEEN</name>
                  <displayName>16 Conversions</displayName>
                  <description>The regular sequence has 16 channels.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured during initialization to define how many channels 
                  are in the regular conversion sequence.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>REGSEQ2</name>
          <displayName>ADC Regular Sequence Register 2</displayName>
          <description>
            Configures the 7ᵗʰ to 12ᵗʰ channels in the regular conversion sequence.
          </description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REGSEQC7</name>
              <displayName>7th Conversion Channel</displayName>
              <description>
                Channel number for the 7th conversion in the regular sequence.
                Valid range: 0-17.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured during initialization to select which channel
                  is converted 7th in the regular sequence.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REGSEQC8</name>
              <displayName>8th Conversion Channel</displayName>
              <description>
                Channel number for the 8th conversion in the regular sequence.
                Valid range: 0-17.
              </description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured during initialization to select which channel
                  is converted 8th in the regular sequence.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REGSEQC9</name>
              <displayName>9th Conversion Channel</displayName>
              <description>
                Channel number for the 9th conversion in the regular sequence.
                Valid range: 0-17.
              </description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured to select which channel is converted 9th 
                  in the regular sequence.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REGSEQC10</name>
              <displayName>10th Conversion Channel</displayName>
              <description>
                Channel number for the 10th conversion in the regular sequence.
                Valid range: 0-17.
              </description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured to select which channel is converted 10th 
                  in the regular sequence.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REGSEQC11</name>
              <displayName>11th Conversion Channel</displayName>
              <description>
                Channel number for the 11th conversion in the regular sequence.
                Valid range: 0-17.
              </description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured to select which channel is converted 11th 
                  in the regular sequence.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REGSEQC12</name>
              <displayName>12th Conversion Channel</displayName>
              <description>
                Channel number for the 12th conversion in the regular sequence.
                Valid range: 0-17.
              </description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Configured to select which channel is converted 12th 
                  in the regular sequence.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>REGSEQ3</name>
          <displayName>ADC Regular Sequence Register 3</displayName>
          <description>
            Configures the 1ˢᵗ to 6ᵗʰ channels in the regular conversion sequence.
          </description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REGSEQC1</name>
              <displayName>1st Conversion Channel</displayName>
              <description>
                Channel number for the 1st conversion in the regular sequence.
                Valid range: 0-17.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Set which channel is converted 1st in the regular sequence.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REGSEQC2</name>
              <displayName>2nd Conversion Channel</displayName>
              <description>
                Channel number for the 2nd conversion in the regular sequence.
                Valid range: 0-17.
              </description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Set which channel is converted 2nd in the regular sequence.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REGSEQC3</name>
              <displayName>3rd Conversion Channel</displayName>
              <description>
                Channel number for the 3rd conversion in the regular sequence.
                Valid range: 0-17.
              </description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Set which channel is converted 3rd in the regular sequence.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REGSEQC4</name>
              <displayName>4th Conversion Channel</displayName>
              <description>
                Channel number for the 4th conversion in the regular sequence.
                Valid range: 0-17.
              </description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Set which channel is converted 4th in the regular sequence.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REGSEQC5</name>
              <displayName>5th Conversion Channel</displayName>
              <description>
                Channel number for the 5th conversion in the regular sequence.
                Valid range: 0-17.
              </description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Set which channel is converted 5th in the regular sequence.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REGSEQC6</name>
              <displayName>6th Conversion Channel</displayName>
              <description>
                Channel number for the 6th conversion in the regular sequence.
                Valid range: 0-17.
              </description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Set which channel is converted 6th in the regular sequence.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPTIM1</name>
          <displayName>ADC Sampling Time Register 1</displayName>
          <description>
            Configures the sample times for ADC channels 0 to 9. Each channel is assigned
            a 3-bit field, indicating the number of ADC clock cycles used for sampling.
          </description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMPCYCCFG1</name>
              <displayName>Sample Time Configuration 1</displayName>
              <description>
                SMPCYCCFG1 covers multiple channels (channels 0..9, 3 bits each = 30 bits),
                but here it's only 27 bits in total. The chapter indicates 8 or 10 channels
                per register, etc. This is a summary of possible arrangement.
                SMPCYCCFG1 holds the sample time configurations (3 bits per channel) for
                multiple ADC channels. Each 3-bit field defines the number of cycles for
                sampling:
                000 = 3 cycles,
                001 = 15 cycles,
                010 = 28 cycles,
                011 = 56 cycles,
                100 = 84 cycles,
                101 = 112 cycles,
                110 = 144 cycles,
                111 = 480 cycles.
                Note: Only 27 bits are used here (9 channels x 3 bits).
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>27</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Typically set during initialization to configure each channel's
                  sampling time for channels covered by SMPTIM1.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPTIM2</name>
          <displayName>ADC Sampling Time Register 2</displayName>
          <description>
            Configures the sample times for additional ADC channels (e.g. 10 to 17). Each
            channel is assigned a 3-bit field, indicating the number of ADC clock cycles
            used for sampling.
          </description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMPCYCCFG2</name>
              <displayName>Sample Time Configuration 2</displayName>
              <description>
                SMPCYCCFG2 covers more channels with 3 bits each. According to the chapter,
                30 bits might be enough for 10 channels.
                SMPCYCCFG2 holds the sample time configurations (3 bits per channel) for
                additional ADC channels. Each 3-bit field defines the number of cycles for
                sampling:
                000 = 3 cycles,
                001 = 15 cycles,
                010 = 28 cycles,
                011 = 56 cycles,
                100 = 84 cycles,
                101 = 112 cycles,
                110 = 144 cycles,
                111 = 480 cycles.
                Note: 30 bits used here (10 channels x 3 bits).
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Typically set during initialization to configure each channel's
                  sampling time for channels covered by SMPTIM2.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
