Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/chip_config.svd
        <register>
          <name>F0BANK1</name>
          <displayName>Filter Bank 0 Register 1</displayName>
          <description>
            FiBANKx: Filter Bank i Register x (i=0..27, x=1..2).
            Stores the 32 filter bits for filter bank i (register x). Depending on the filter mode (mask or identifier list)
            and bit width (16-bit or 32-bit) configured via CAN_FMCFG and CAN_FSCFG, these 32 bits are interpreted either as
            mask bits or identifier bits for filtering CAN messages. In "identifier mask" mode, a bit of '1' in this register
            indicates that the corresponding ID bit must match. In "identifier list" mode, these bits form part of the exact
            ID pattern. The register can only be modified if the filter is in initialization mode (FINITEN=1 in CAN_FCTRL) or
            if the filter is disabled (FACTx=0). Once activated, the filter logic will use these bits, in conjunction with
            the other filter bank register (FiBANK1 or FiBANK2), to decide which incoming CAN messages pass to the receive FIFO.
          </description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field><name>FBIT0</name><description>Filter bits</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT1</name><description>Filter bits</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT2</name><description>Filter bits</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT3</name><description>Filter bits</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT4</name><description>Filter bits</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT5</name><description>Filter bits</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT6</name><description>Filter bits</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT7</name><description>Filter bits</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT8</name><description>Filter bits</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT9</name><description>Filter bits</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT10</name><description>Filter bits</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT11</name><description>Filter bits</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT12</name><description>Filter bits</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT13</name><description>Filter bits</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT14</name><description>Filter bits</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT15</name><description>Filter bits</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT16</name><description>Filter bits</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT17</name><description>Filter bits</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT18</name><description>Filter bits</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT19</name><description>Filter bits</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT20</name><description>Filter bits</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT21</name><description>Filter bits</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT22</name><description>Filter bits</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT23</name><description>Filter bits</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT24</name><description>Filter bits</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT25</name><description>Filter bits</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT26</name><description>Filter bits</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT27</name><description>Filter bits</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT28</name><description>Filter bits</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT29</name><description>Filter bits</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT30</name><description>Filter bits</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT31</name><description>Filter bits</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
          <vendorExtensions>
            <embeetle:registerKind>setting</embeetle:registerKind>
            <embeetle:registerKindCmt>All filter bits are typically configured once during CAN initialization or reconfiguration, so this register is considered a 'setting' register.</embeetle:registerKindCmt>
          </vendorExtensions>
        </register>
        <register>
          <name>F0BANK2</name>
          <displayName>Filter Bank 0 Register 2</displayName>
          <description>
            FiBANKx: Filter Bank i Register x (i=0..27, x=1..2).
            Stores the 32 filter bits for filter bank i (register x). Depending on the filter mode (mask or identifier list)
            and bit width (16-bit or 32-bit) configured via CAN_FMCFG and CAN_FSCFG, these 32 bits are interpreted either as
            mask bits or identifier bits for filtering CAN messages. In "identifier mask" mode, a bit of '1' in this register
            indicates that the corresponding ID bit must match. In "identifier list" mode, these bits form part of the exact
            ID pattern. The register can only be modified if the filter is in initialization mode (FINITEN=1 in CAN_FCTRL) or
            if the filter is disabled (FACTx=0). Once activated, the filter logic will use these bits, in conjunction with
            the other filter bank register (FiBANK1 or FiBANK2), to decide which incoming CAN messages pass to the receive FIFO.
          </description>
          <addressOffset>0x244</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field><name>FBIT0</name><description>Filter bits</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT1</name><description>Filter bits</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT2</name><description>Filter bits</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT3</name><description>Filter bits</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT4</name><description>Filter bits</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT5</name><description>Filter bits</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT6</name><description>Filter bits</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT7</name><description>Filter bits</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT8</name><description>Filter bits</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT9</name><description>Filter bits</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT10</name><description>Filter bits</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT11</name><description>Filter bits</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT12</name><description>Filter bits</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT13</name><description>Filter bits</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT14</name><description>Filter bits</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT15</name><description>Filter bits</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT16</name><description>Filter bits</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT17</name><description>Filter bits</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT18</name><description>Filter bits</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT19</name><description>Filter bits</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT20</name><description>Filter bits</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT21</name><description>Filter bits</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT22</name><description>Filter bits</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT23</name><description>Filter bits</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT24</name><description>Filter bits</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT25</name><description>Filter bits</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT26</name><description>Filter bits</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT27</name><description>Filter bits</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT28</name><description>Filter bits</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT29</name><description>Filter bits</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT30</name><description>Filter bits</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT31</name><description>Filter bits</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
          <vendorExtensions>
            <embeetle:registerKind>setting</embeetle:registerKind>
            <embeetle:registerKindCmt>All filter bits are typically configured once during CAN initialization or reconfiguration, so this register is considered a 'setting' register.</embeetle:registerKindCmt>
          </vendorExtensions>
        </register>
        <register>
          <name>F1BANK1</name>
          <displayName>Filter Bank 1 Register 1</displayName>
          <description>
            FiBANKx: Filter Bank i Register x (i=0..27, x=1..2).
            Stores the 32 filter bits for filter bank i (register x). Depending on the filter mode (mask or identifier list)
            and bit width (16-bit or 32-bit) configured via CAN_FMCFG and CAN_FSCFG, these 32 bits are interpreted either as
            mask bits or identifier bits for filtering CAN messages. In "identifier mask" mode, a bit of '1' in this register
            indicates that the corresponding ID bit must match. In "identifier list" mode, these bits form part of the exact
            ID pattern. The register can only be modified if the filter is in initialization mode (FINITEN=1 in CAN_FCTRL) or
            if the filter is disabled (FACTx=0). Once activated, the filter logic will use these bits, in conjunction with
            the other filter bank register (FiBANK1 or FiBANK2), to decide which incoming CAN messages pass to the receive FIFO.
          </description>
          <addressOffset>0x248</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field><name>FBIT0</name><description>Filter bits</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT1</name><description>Filter bits</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT2</name><description>Filter bits</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT3</name><description>Filter bits</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT4</name><description>Filter bits</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT5</name><description>Filter bits</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT6</name><description>Filter bits</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT7</name><description>Filter bits</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT8</name><description>Filter bits</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT9</name><description>Filter bits</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT10</name><description>Filter bits</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT11</name><description>Filter bits</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT12</name><description>Filter bits</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT13</name><description>Filter bits</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT14</name><description>Filter bits</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT15</name><description>Filter bits</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT16</name><description>Filter bits</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT17</name><description>Filter bits</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT18</name><description>Filter bits</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT19</name><description>Filter bits</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT20</name><description>Filter bits</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT21</name><description>Filter bits</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT22</name><description>Filter bits</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT23</name><description>Filter bits</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT24</name><description>Filter bits</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT25</name><description>Filter bits</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT26</name><description>Filter bits</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT27</name><description>Filter bits</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT28</name><description>Filter bits</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT29</name><description>Filter bits</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT30</name><description>Filter bits</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT31</name><description>Filter bits</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
          <vendorExtensions>
            <embeetle:registerKind>setting</embeetle:registerKind>
            <embeetle:registerKindCmt>All filter bits are typically configured once during CAN initialization or reconfiguration, so this register is considered a 'setting' register.</embeetle:registerKindCmt>
          </vendorExtensions>
        </register>
        <register>
          <name>F1BANK2</name>
          <displayName>Filter Bank 1 Register 2</displayName>
          <description>
            FiBANKx: Filter Bank i Register x (i=0..27, x=1..2).
            Stores the 32 filter bits for filter bank i (register x). Depending on the filter mode (mask or identifier list)
            and bit width (16-bit or 32-bit) configured via CAN_FMCFG and CAN_FSCFG, these 32 bits are interpreted either as
            mask bits or identifier bits for filtering CAN messages. In "identifier mask" mode, a bit of '1' in this register
            indicates that the corresponding ID bit must match. In "identifier list" mode, these bits form part of the exact
            ID pattern. The register can only be modified if the filter is in initialization mode (FINITEN=1 in CAN_FCTRL) or
            if the filter is disabled (FACTx=0). Once activated, the filter logic will use these bits, in conjunction with
            the other filter bank register (FiBANK1 or FiBANK2), to decide which incoming CAN messages pass to the receive FIFO.
          </description>
          <addressOffset>0x24C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field><name>FBIT0</name><description>Filter bits</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT1</name><description>Filter bits</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT2</name><description>Filter bits</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT3</name><description>Filter bits</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT4</name><description>Filter bits</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT5</name><description>Filter bits</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT6</name><description>Filter bits</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT7</name><description>Filter bits</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT8</name><description>Filter bits</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT9</name><description>Filter bits</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT10</name><description>Filter bits</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT11</name><description>Filter bits</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT12</name><description>Filter bits</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT13</name><description>Filter bits</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT14</name><description>Filter bits</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT15</name><description>Filter bits</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT16</name><description>Filter bits</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT17</name><description>Filter bits</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT18</name><description>Filter bits</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT19</name><description>Filter bits</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT20</name><description>Filter bits</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT21</name><description>Filter bits</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT22</name><description>Filter bits</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT23</name><description>Filter bits</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT24</name><description>Filter bits</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT25</name><description>Filter bits</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT26</name><description>Filter bits</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT27</name><description>Filter bits</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT28</name><description>Filter bits</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT29</name><description>Filter bits</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT30</name><description>Filter bits</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBIT31</name><description>Filter bits</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
          <vendorExtensions>
            <embeetle:registerKind>setting</embeetle:registerKind>
            <embeetle:registerKindCmt>All filter bits are typically configured once during CAN initialization or reconfiguration, so this register is considered a 'setting' register.</embeetle:registerKindCmt>
          </vendorExtensions>
        </register>
