Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/chip_config.svd
        <register>
          <name>MSTS</name>
          <displayName>CAN Main Status Register</displayName>
          <description>
            Reflects the controller's current mode (initialization/sleep), active interrupts,
            and transmit/receive states. Some flags are set by hardware and cleared by
            writing 1 (RC_W1).
          </description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x00000C02</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INITFLG</name>
              <displayName>Initialization Mode Flag</displayName>
              <description>Indicates whether the CAN is in initialization mode (1) or not (0). Set/cleared by hardware.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_MODE</name>
                  <displayName>Normal Mode</displayName>
                  <description>CAN is not in initialization mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INIT_MODE</name>
                  <displayName>Initialization Mode</displayName>
                  <description>CAN is in initialization mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Reflects the hardware state after setting INITREQ.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>SLEEPFLG</name>
              <displayName>Sleep Mode Flag</displayName>
              <description>Indicates whether the CAN is in sleep mode (1) or not (0). Set/cleared by hardware.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AWAKE</name>
                  <displayName>Awake</displayName>
                  <description>CAN is not in sleep mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASLEEP</name>
                  <displayName>Asleep</displayName>
                  <description>CAN is in sleep mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Reflects the hardware state after setting SLEEPREQ.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>ERRIFLG</name>
              <displayName>Error Interrupt Occur Flag</displayName>
              <description>
                Set by hardware when an error interrupt event occurs; cleared by writing 1.
              </description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ERROR_INT</name>
                  <displayName>No Error Interrupt</displayName>
                  <description>No new error interrupt has occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERROR_INT</name>
                  <displayName>Error Interrupt Occurred</displayName>
                  <description>An error interrupt event has occurred.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Set by hardware; software writes 1 to clear.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>WUPIFLG</name>
              <displayName>Wakeup Interrupt Occur Flag</displayName>
              <description>
                Set by hardware when waking up from sleep mode; cleared by writing 1.
              </description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_WAKEUP_INT</name>
                  <displayName>No Wakeup Interrupt</displayName>
                  <description>Did not wake up from sleep or flag cleared.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAKEUP_INT</name>
                  <displayName>Wakeup Interrupt Occurred</displayName>
                  <description>CAN woke up from sleep mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Set by hardware upon wakeup; software writes 1 to clear.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>SLEEPIFLG</name>
              <displayName>Sleep Interrupt Flag</displayName>
              <description>
                Set by hardware when entering sleep mode; cleared by writing 1 or by exiting
                sleep mode.
              </description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_SLEEP_INT</name>
                  <displayName>No Sleep Interrupt</displayName>
                  <description>Not entered sleep mode or flag cleared.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLEEP_INT</name>
                  <displayName>Sleep Interrupt Occurred</displayName>
                  <description>Entered sleep mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Set by hardware upon entering sleep; software writes 1 to clear.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>TXMFLG</name>
              <displayName>Transmit Mode Flag</displayName>
              <description>
                Indicates whether CAN is currently transmitting (1) or not (0). Set/cleared
                by hardware.
              </description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_TRANSMITTING</name>
                  <displayName>Not Transmitting</displayName>
                  <description>CAN is not in transmission mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRANSMITTING</name>
                  <displayName>Transmitting</displayName>
                  <description>CAN is in the process of sending a frame.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Reflects hardware's transmit state in real-time.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>RXMFLG</name>
              <displayName>Receive Mode Flag</displayName>
              <description>
                Indicates whether CAN is currently receiving (1) or not (0). Set/cleared
                by hardware.
              </description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_RECEIVING</name>
                  <displayName>Not Receiving</displayName>
                  <description>CAN is not in reception mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RECEIVING</name>
                  <displayName>Receiving</displayName>
                  <description>CAN is currently receiving a frame.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Reflects hardware's receive state in real-time.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>LSAMVALUE</name>
              <displayName>Last Sample Value</displayName>
              <description>
                Displays the last sampled level on the CAN_RX pin. Set/cleared by hardware.
              </description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DOMINANT</name>
                  <displayName>Dominant</displayName>
                  <description>Sampled a dominant (logic 0) level.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RECESSIVE</name>
                  <displayName>Recessive</displayName>
                  <description>Sampled a recessive (logic 1) level.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Reflects the most recent state of the bus.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>RXSIGL</name>
              <displayName>Rx Pin Signal Level</displayName>
              <description>
                Shows the current real-time level of the CAN_RX pin. Set/cleared by hardware.
              </description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DOMINANT</name>
                  <displayName>Dominant</displayName>
                  <description>Rx pin is currently at a dominant (0) level.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RECESSIVE</name>
                  <displayName>Recessive</displayName>
                  <description>Rx pin is currently at a recessive (1) level.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Reflects the current external signal on CAN_RX.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>RXDLEN0</name>
          <displayName>CAN Receive Mailbox Data Length Register 0</displayName>
          <description>
            Holds the data length code (DLC) and the filter match index (FMIDX)
            for the received message in mailbox 0.
          </description>
          <addressOffset>0x1B4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DLCODE</name>
              <displayName>Data Length Code</displayName>
              <description>
                Indicates the number of data bytes (0..8) in the received frame.
                For a remote frame, DLCODE is always 0.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DL0</name>
                  <displayName>0 bytes</displayName>
                  <description>No data bytes (or a remote frame).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DL1</name>
                  <displayName>1 byte</displayName>
                  <description>1 data byte.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DL2</name>
                  <displayName>2 bytes</displayName>
                  <description>2 data bytes.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DL3</name>
                  <displayName>3 bytes</displayName>
                  <description>3 data bytes.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DL4</name>
                  <displayName>4 bytes</displayName>
                  <description>4 data bytes.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DL5</name>
                  <displayName>5 bytes</displayName>
                  <description>5 data bytes.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DL6</name>
                  <displayName>6 bytes</displayName>
                  <description>6 data bytes.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DL7</name>
                  <displayName>7 bytes</displayName>
                  <description>7 data bytes.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DL8</name>
                  <displayName>8 bytes</displayName>
                  <description>8 data bytes.</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  This is read during runtime to determine how many data bytes were
                  received in the frame.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>FMIDX</name>
              <displayName>Filter Match Index</displayName>
              <description>
                Indicates which filter index (0..27) accepted the received message.
                Values above 27 are possible if multiple filters exist, but only
                28 hardware filters are available.
              </description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Read at runtime to identify which filter was triggered by the current message.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>RXDLEN1</name>
          <displayName>CAN Receive Mailbox Data Length Register 1</displayName>
          <description>
            Holds the data length code (DLC) and the filter match index (FMIDX)
            for the received message in mailbox 1.
          </description>
          <addressOffset>0x1C4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DLCODE</name>
              <displayName>Data Length Code</displayName>
              <description>
                Indicates the number of data bytes (0..8) in the received frame.
                For a remote frame, DLCODE is always 0.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DL0</name>
                  <displayName>0 bytes</displayName>
                  <description>No data bytes (or a remote frame).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DL1</name>
                  <displayName>1 byte</displayName>
                  <description>1 data byte.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DL2</name>
                  <displayName>2 bytes</displayName>
                  <description>2 data bytes.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DL3</name>
                  <displayName>3 bytes</displayName>
                  <description>3 data bytes.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DL4</name>
                  <displayName>4 bytes</displayName>
                  <description>4 data bytes.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DL5</name>
                  <displayName>5 bytes</displayName>
                  <description>5 data bytes.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DL6</name>
                  <displayName>6 bytes</displayName>
                  <description>6 data bytes.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DL7</name>
                  <displayName>7 bytes</displayName>
                  <description>7 data bytes.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DL8</name>
                  <displayName>8 bytes</displayName>
                  <description>8 data bytes.</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  This is read during runtime to determine how many data bytes were
                  received in the frame (mailbox 1).
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>FMIDX</name>
              <displayName>Filter Match Index</displayName>
              <description>
                Indicates which filter index (0..27) accepted the received message.
                Values above 27 are possible if multiple filters exist, but only
                28 hardware filters are available.
              </description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Read at runtime to identify which filter was triggered by the current message (mailbox 1).
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
