Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/chip_config.svd
        <register>
          <name>RXMDL1</name>
          <displayName>CAN Receive Mailbox Low Byte Data Register 1</displayName>
          <description>
            Holds the low data bytes (0..3) of the received message in mailbox 1.
          </description>
          <addressOffset>0x1C8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATABYTE0</name>
              <displayName>Data Byte 0</displayName>
              <description>0th data byte of the received message.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Read at runtime to retrieve byte 0 of the CAN frame in mailbox 1.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DATABYTE1</name>
              <displayName>Data Byte 1</displayName>
              <description>1st data byte of the received message.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Read at runtime to retrieve byte 1 of the CAN frame in mailbox 1.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DATABYTE2</name>
              <displayName>Data Byte 2</displayName>
              <description>2nd data byte of the received message.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Read at runtime to retrieve byte 2 of the CAN frame in mailbox 1.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DATABYTE3</name>
              <displayName>Data Byte 3</displayName>
              <description>3rd data byte of the received message.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Read at runtime to retrieve byte 3 of the CAN frame in mailbox 1.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>RXMID0</name>
          <displayName>CAN Receive Mailbox Identifier Register 0</displayName>
          <description>This register holds the identifier of the message currently at the output of Receive FIFO 0.</description>
          <addressOffset>0x1B0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RFTXREQ</name>
              <displayName>Remote Frame Transmission Request</displayName>
              <description>Indicates whether the received frame is a remote frame or a data frame.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA</name>
                  <displayName>Data Frame</displayName>
                  <description>Indicates that this is a data frame.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REMOTE</name>
                  <displayName>Remote Frame</displayName>
                  <description>Indicates that this is a remote frame.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This read-only bit is updated by hardware to signal the frame type at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>IDTYPESEL</name>
              <displayName>Identifier Type Select</displayName>
              <description>Indicates whether the message uses a standard 11-bit identifier or an extended 29-bit identifier.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STANDARD</name>
                  <displayName>Standard Identifier (11-bit)</displayName>
                  <description>The message uses an 11-bit standard identifier.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTENDED</name>
                  <displayName>Extended Identifier (29-bit)</displayName>
                  <description>The message uses a 29-bit extended identifier.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This read-only bit is updated by hardware to show identifier type at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>EXTID</name>
              <displayName>Extended Identifier (Bits [17:0])</displayName>
              <description>When IDTYPESEL=1 (extended ID), these bits hold the lower 18 bits of the 29-bit identifier.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This read-only field is updated by hardware to reflect the lower extended ID bits.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>STDID</name>
              <displayName>Standard Identifier or Extended ID High Bits</displayName>
              <description>When IDTYPESEL=0, these bits hold the 11-bit standard ID. When IDTYPESEL=1, these bits hold the upper 11 bits [28:18] of the extended ID.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This read-only field is updated by hardware to reflect the standard ID or upper extended ID bits.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>RXMID1</name>
          <displayName>CAN Receive Mailbox Identifier Register 1</displayName>
          <description>This register holds the identifier of the message currently at the output of Receive FIFO 1.</description>
          <addressOffset>0x1C0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RFTXREQ</name>
              <displayName>Remote Frame Transmission Request</displayName>
              <description>Indicates whether the received frame is a remote frame or a data frame.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA</name>
                  <displayName>Data Frame</displayName>
                  <description>Indicates that this is a data frame.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REMOTE</name>
                  <displayName>Remote Frame</displayName>
                  <description>Indicates that this is a remote frame.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This read-only bit is updated by hardware to signal the frame type at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>IDTYPESEL</name>
              <displayName>Identifier Type Select</displayName>
              <description>Indicates whether the message uses a standard 11-bit identifier or an extended 29-bit identifier.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STANDARD</name>
                  <displayName>Standard Identifier (11-bit)</displayName>
                  <description>The message uses an 11-bit standard identifier.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTENDED</name>
                  <displayName>Extended Identifier (29-bit)</displayName>
                  <description>The message uses a 29-bit extended identifier.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This read-only bit is updated by hardware to show identifier type at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>EXTID</name>
              <displayName>Extended Identifier (Bits [17:0])</displayName>
              <description>When IDTYPESEL=1 (extended ID), these bits hold the lower 18 bits of the 29-bit identifier.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This read-only field is updated by hardware to reflect the lower extended ID bits.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>STDID</name>
              <displayName>Standard Identifier or Extended ID High Bits</displayName>
              <description>When IDTYPESEL=0, these bits hold the 11-bit standard ID. When IDTYPESEL=1, these bits hold the upper 11 bits [28:18] of the extended ID.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This read-only field is updated by hardware to reflect the standard ID or upper extended ID bits.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDLEN0</name>
          <displayName>CAN Transmit Mailbox Data Length Register 0</displayName>
          <description>
            This register holds the data length code (DLC) for the message to be transmitted from mailbox 0. When the mailbox is not idle,
            all bits of this register are write-protected. A maximum of 8 data bytes is supported.
          </description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DLCODE</name>
              <displayName>Data Length Code</displayName>
              <description>Specifies the length of the data field (0-8 bytes) for the transmitted message.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEN_0</name>
                  <displayName>Data Length 0</displayName>
                  <description>Frame has 0 data bytes.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEN_1</name>
                  <displayName>Data Length 1</displayName>
                  <description>Frame has 1 data byte.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEN_2</name>
                  <displayName>Data Length 2</displayName>
                  <description>Frame has 2 data bytes.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEN_3</name>
                  <displayName>Data Length 3</displayName>
                  <description>Frame has 3 data bytes.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEN_4</name>
                  <displayName>Data Length 4</displayName>
                  <description>Frame has 4 data bytes.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEN_5</name>
                  <displayName>Data Length 5</displayName>
                  <description>Frame has 5 data bytes.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEN_6</name>
                  <displayName>Data Length 6</displayName>
                  <description>Frame has 6 data bytes.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEN_7</name>
                  <displayName>Data Length 7</displayName>
                  <description>Frame has 7 data bytes.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEN_8</name>
                  <displayName>Data Length 8</displayName>
                  <description>Frame has 8 data bytes.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED_9</name>
                  <displayName>Reserved 9</displayName>
                  <description>Reserved, not used.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED_10</name>
                  <displayName>Reserved 10</displayName>
                  <description>Reserved, not used.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED_11</name>
                  <displayName>Reserved 11</displayName>
                  <description>Reserved, not used.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED_12</name>
                  <displayName>Reserved 12</displayName>
                  <description>Reserved, not used.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED_13</name>
                  <displayName>Reserved 13</displayName>
                  <description>Reserved, not used.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED_14</name>
                  <displayName>Reserved 14</displayName>
                  <description>Reserved, not used.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED_15</name>
                  <displayName>Reserved 15</displayName>
                  <description>Reserved, not used.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This bitfield is set each time a message is prepared for transmission (i.e., at runtime).</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDLEN1</name>
          <displayName>CAN Transmit Mailbox Data Length Register 1</displayName>
          <description>
            This register holds the data length code (DLC) for the message to be transmitted from mailbox 1. When the mailbox is not idle,
            all bits of this register are write-protected. A maximum of 8 data bytes is supported.
          </description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DLCODE</name>
              <displayName>Data Length Code</displayName>
              <description>Specifies the length of the data field (0-8 bytes) for the transmitted message.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEN_0</name>
                  <displayName>Data Length 0</displayName>
                  <description>Frame has 0 data bytes.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEN_1</name>
                  <displayName>Data Length 1</displayName>
                  <description>Frame has 1 data byte.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEN_2</name>
                  <displayName>Data Length 2</displayName>
                  <description>Frame has 2 data bytes.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEN_3</name>
                  <displayName>Data Length 3</displayName>
                  <description>Frame has 3 data bytes.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEN_4</name>
                  <displayName>Data Length 4</displayName>
                  <description>Frame has 4 data bytes.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEN_5</name>
                  <displayName>Data Length 5</displayName>
                  <description>Frame has 5 data bytes.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEN_6</name>
                  <displayName>Data Length 6</displayName>
                  <description>Frame has 6 data bytes.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEN_7</name>
                  <displayName>Data Length 7</displayName>
                  <description>Frame has 7 data bytes.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEN_8</name>
                  <displayName>Data Length 8</displayName>
                  <description>Frame has 8 data bytes.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED_9</name>
                  <displayName>Reserved 9</displayName>
                  <description>Reserved, not used.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED_10</name>
                  <displayName>Reserved 10</displayName>
                  <description>Reserved, not used.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED_11</name>
                  <displayName>Reserved 11</displayName>
                  <description>Reserved, not used.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED_12</name>
                  <displayName>Reserved 12</displayName>
                  <description>Reserved, not used.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED_13</name>
                  <displayName>Reserved 13</displayName>
                  <description>Reserved, not used.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED_14</name>
                  <displayName>Reserved 14</displayName>
                  <description>Reserved, not used.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED_15</name>
                  <displayName>Reserved 15</displayName>
                  <description>Reserved, not used.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This bitfield is set each time a message is prepared for transmission (i.e., at runtime).</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
