Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/chip_config.svd
        <register>
          <name>TXDLEN2</name>
          <displayName>CAN Transmit Mailbox Data Length Register 2</displayName>
          <description>
            This register holds the data length code (DLC) for the message to be transmitted from mailbox 2. When the mailbox is not idle,
            all bits of this register are write-protected. A maximum of 8 data bytes is supported.
          </description>
          <addressOffset>0x1A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DLCODE</name>
              <displayName>Data Length Code</displayName>
              <description>Specifies the length of the data field (0-8 bytes) for the transmitted message.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEN_0</name>
                  <displayName>Data Length 0</displayName>
                  <description>Frame has 0 data bytes.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEN_1</name>
                  <displayName>Data Length 1</displayName>
                  <description>Frame has 1 data byte.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEN_2</name>
                  <displayName>Data Length 2</displayName>
                  <description>Frame has 2 data bytes.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEN_3</name>
                  <displayName>Data Length 3</displayName>
                  <description>Frame has 3 data bytes.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEN_4</name>
                  <displayName>Data Length 4</displayName>
                  <description>Frame has 4 data bytes.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEN_5</name>
                  <displayName>Data Length 5</displayName>
                  <description>Frame has 5 data bytes.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEN_6</name>
                  <displayName>Data Length 6</displayName>
                  <description>Frame has 6 data bytes.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEN_7</name>
                  <displayName>Data Length 7</displayName>
                  <description>Frame has 7 data bytes.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEN_8</name>
                  <displayName>Data Length 8</displayName>
                  <description>Frame has 8 data bytes.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED_9</name>
                  <displayName>Reserved 9</displayName>
                  <description>Reserved, not used.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED_10</name>
                  <displayName>Reserved 10</displayName>
                  <description>Reserved, not used.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED_11</name>
                  <displayName>Reserved 11</displayName>
                  <description>Reserved, not used.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED_12</name>
                  <displayName>Reserved 12</displayName>
                  <description>Reserved, not used.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED_13</name>
                  <displayName>Reserved 13</displayName>
                  <description>Reserved, not used.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED_14</name>
                  <displayName>Reserved 14</displayName>
                  <description>Reserved, not used.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED_15</name>
                  <displayName>Reserved 15</displayName>
                  <description>Reserved, not used.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This bitfield is set each time a message is prepared for transmission (i.e., at runtime).</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>TXMDH0</name>
          <displayName>CAN Transmit Mailbox High-Byte Data Register 0</displayName>
          <description>This register holds data bytes [4..7] for the message to be transmitted from mailbox 0. When the mailbox is not idle, these bits are write-protected.</description>
          <addressOffset>0x18C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATABYTE4</name>
              <displayName>Data Byte 4</displayName>
              <description>Contains the fourth data byte (bits 7..0) of the transmitted message.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Data bytes are filled when preparing the message for transmission at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DATABYTE5</name>
              <displayName>Data Byte 5</displayName>
              <description>Contains the fifth data byte (bits 15..8) of the transmitted message.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Data bytes are filled when preparing the message for transmission at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DATABYTE6</name>
              <displayName>Data Byte 6</displayName>
              <description>Contains the sixth data byte (bits 23..16) of the transmitted message.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Data bytes are filled when preparing the message for transmission at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DATABYTE7</name>
              <displayName>Data Byte 7</displayName>
              <description>Contains the seventh data byte (bits 31..24) of the transmitted message.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Data bytes are filled when preparing the message for transmission at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>TXMDH1</name>
          <displayName>CAN Transmit Mailbox High-Byte Data Register 1</displayName>
          <description>This register holds data bytes [4..7] for the message to be transmitted from mailbox 1. When the mailbox is not idle, these bits are write-protected.</description>
          <addressOffset>0x19C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATABYTE4</name>
              <displayName>Data Byte 4</displayName>
              <description>Contains the fourth data byte (bits 7..0) of the transmitted message.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Data bytes are filled when preparing the message for transmission at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DATABYTE5</name>
              <displayName>Data Byte 5</displayName>
              <description>Contains the fifth data byte (bits 15..8) of the transmitted message.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Data bytes are filled when preparing the message for transmission at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DATABYTE6</name>
              <displayName>Data Byte 6</displayName>
              <description>Contains the sixth data byte (bits 23..16) of the transmitted message.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Data bytes are filled when preparing the message for transmission at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DATABYTE7</name>
              <displayName>Data Byte 7</displayName>
              <description>Contains the seventh data byte (bits 31..24) of the transmitted message.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Data bytes are filled when preparing the message for transmission at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>TXMDH2</name>
          <displayName>CAN Transmit Mailbox High-Byte Data Register 2</displayName>
          <description>This register holds data bytes [4..7] for the message to be transmitted from mailbox 2. When the mailbox is not idle, these bits are write-protected.</description>
          <addressOffset>0x1AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATABYTE4</name>
              <displayName>Data Byte 4</displayName>
              <description>Contains the fourth data byte (bits 7..0) of the transmitted message.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Data bytes are filled when preparing the message for transmission at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DATABYTE5</name>
              <displayName>Data Byte 5</displayName>
              <description>Contains the fifth data byte (bits 15..8) of the transmitted message.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Data bytes are filled when preparing the message for transmission at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DATABYTE6</name>
              <displayName>Data Byte 6</displayName>
              <description>Contains the sixth data byte (bits 23..16) of the transmitted message.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Data bytes are filled when preparing the message for transmission at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DATABYTE7</name>
              <displayName>Data Byte 7</displayName>
              <description>Contains the seventh data byte (bits 31..24) of the transmitted message.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Data bytes are filled when preparing the message for transmission at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>TXMDL0</name>
          <displayName>CAN Transmit Mailbox Low-Byte Data Register 0</displayName>
          <description>This register holds data bytes [0..3] for the message to be transmitted from mailbox 0. When the mailbox is not idle, these bits are write-protected.</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATABYTE0</name>
              <displayName>Data Byte 0</displayName>
              <description>Contains the first data byte (bits 7..0) of the transmitted message.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Data bytes are filled when preparing the message for transmission at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DATABYTE1</name>
              <displayName>Data Byte 1</displayName>
              <description>Contains the second data byte (bits 15..8) of the transmitted message.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Data bytes are filled when preparing the message for transmission at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DATABYTE2</name>
              <displayName>Data Byte 2</displayName>
              <description>Contains the third data byte (bits 23..16) of the transmitted message.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Data bytes are filled when preparing the message for transmission at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DATABYTE3</name>
              <displayName>Data Byte 3</displayName>
              <description>Contains the fourth data byte (bits 31..24) of the transmitted message.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Data bytes are filled when preparing the message for transmission at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>TXMDL1</name>
          <displayName>CAN Transmit Mailbox Low-Byte Data Register 1</displayName>
          <description>This register holds data bytes [0..3] for the message to be transmitted from mailbox 1. When the mailbox is not idle, these bits are write-protected.</description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATABYTE0</name>
              <displayName>Data Byte 0</displayName>
              <description>Contains the first data byte (bits 7..0) of the transmitted message.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Data bytes are filled when preparing the message for transmission at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DATABYTE1</name>
              <displayName>Data Byte 1</displayName>
              <description>Contains the second data byte (bits 15..8) of the transmitted message.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Data bytes are filled when preparing the message for transmission at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DATABYTE2</name>
              <displayName>Data Byte 2</displayName>
              <description>Contains the third data byte (bits 23..16) of the transmitted message.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Data bytes are filled when preparing the message for transmission at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DATABYTE3</name>
              <displayName>Data Byte 3</displayName>
              <description>Contains the fourth data byte (bits 31..24) of the transmitted message.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Data bytes are filled when preparing the message for transmission at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
