Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/chip_config.svd
                <embeetle:fieldKindCmt>Used at runtime to check mailbox 2 availability.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>LOWESTP0</name>
              <displayName>Lowest Priority Flag Mailbox 0</displayName>
              <description>Indicates mailbox 0 is the lowest priority among mailboxes waiting to transmit (only relevant when multiple mailboxes are pending).</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_LOWEST</name>
                  <displayName>Not Lowest</displayName>
                  <description>Mailbox 0 is not the lowest priority transmitter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOWEST</name>
                  <displayName>Lowest</displayName>
                  <description>Mailbox 0 is the lowest priority transmitter</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Indicates mailbox 0's relative priority at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>LOWESTP1</name>
              <displayName>Lowest Priority Flag Mailbox 1</displayName>
              <description>Indicates mailbox 1 is the lowest priority among mailboxes waiting to transmit (only relevant when multiple mailboxes are pending).</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_LOWEST</name>
                  <displayName>Not Lowest</displayName>
                  <description>Mailbox 1 is not the lowest priority transmitter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOWEST</name>
                  <displayName>Lowest</displayName>
                  <description>Mailbox 1 is the lowest priority transmitter</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Indicates mailbox 1's relative priority at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>LOWESTP2</name>
              <displayName>Lowest Priority Flag Mailbox 2</displayName>
              <description>Indicates mailbox 2 is the lowest priority among mailboxes waiting to transmit (only relevant when multiple mailboxes are pending).</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_LOWEST</name>
                  <displayName>Not Lowest</displayName>
                  <description>Mailbox 2 is not the lowest priority transmitter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOWEST</name>
                  <displayName>Lowest</displayName>
                  <description>Mailbox 2 is the lowest priority transmitter</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Indicates mailbox 2's relative priority at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CAN2</name>
      <description>Controller area network</description>
      <groupName>CAN</groupName>
      <baseAddress>0x40006800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <interrupt>
        <name>CAN2_TX</name>
        <description>CAN2 TX interrupts</description>
        <value>63</value>
      </interrupt>
      <interrupt>
        <name>CAN2_RX0</name>
        <description>CAN2 RX0 interrupts</description>
        <value>64</value>
      </interrupt>
      <interrupt>
        <name>CAN2_RX1</name>
        <description>CAN2 RX1 interrupts</description>
        <value>65</value>
      </interrupt>
      <interrupt>
        <name>CAN2_SCE</name>
        <description>CAN2 SCE interrupt</description>
        <value>66</value>
      </interrupt>
      <registers>
        <register>
          <name>BITTIM</name>
          <displayName>CAN Bit Timing Register</displayName>
          <description>Configures the CAN bit timing parameters (such as prescaler and time segments). This register is only accessible in Initialization mode.</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x01230000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BRPSC</name>
              <displayName>Baud Rate Prescaler</displayName>
              <description>Sets the baud rate prescaler: Tq = (BRPSC + 1) x TPCLK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This prescaler is typically configured once during CAN initialization.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>TIMSEG1</name>
              <displayName>Time Segment 1</displayName>
              <description>Configures Time Segment 1 (BS1). The duration is tBS1 = tCAN x (TIMSEG1 + 1)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Time segment 1 is set during CAN initialization.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>TIMSEG2</name>
              <displayName>Time Segment 2</displayName>
              <description>Configures Time Segment 2 (BS2). The duration is tBS2 = tCAN x (TIMSEG2 + 1)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Time segment 2 is set during CAN initialization.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>RSYNJW</name>
              <displayName>Resynchronization Jump Width</displayName>
              <description>Configures the resynchronization jump width: tRJW = tCAN x (RSYNJW + 1)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>The resynchronization jump width is set during CAN initialization.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>LBKMEN</name>
              <displayName>Loopback Mode Enable</displayName>
              <description>Enables or disables Loopback mode for CAN self‑test. Valid only while in Initialization mode.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <displayName>DISABLE</displayName>
                  <description>Loopback mode disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <displayName>ENABLE</displayName>
                  <description>Loopback mode enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Loopback mode is selected only during CAN initialization.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>SILMEN</name>
              <displayName>Silent Mode Enable</displayName>
              <description>Enables or disables Silent (mute) mode. Valid only while in Initialization mode.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <displayName>DISABLE</displayName>
                  <description>Silent mode disabled (normal operation)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <displayName>ENABLE</displayName>
                  <description>Silent (mute) mode enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Silent mode is selected only during CAN initialization.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>ERRSTS</name>
          <displayName>CAN Error Status Register</displayName>
          <description>Reflects various CAN error states and counters, including warning, passive, and bus-off conditions.</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <protection>n</protection>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ERRWFLG</name>
              <displayName>Error Warning Flag</displayName>
              <description>Indicates that the CAN controller has reached the error warning level (RX or TX error counter ≥ 96).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_WARNING</name>
                  <displayName>NO_WARNING</displayName>
                  <description>No error warning occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WARNING</name>
                  <displayName>WARNING</displayName>
                  <description>Error warning level reached.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Software reads this flag at runtime to detect error warnings.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>ERRPFLG</name>
              <displayName>Error Passive Flag</displayName>
              <description>Indicates that the CAN controller has entered error passive (RX or TX error counter &gt; 127).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_PASSIVE</name>
                  <displayName>NO_PASSIVE</displayName>
                  <description>No passive error occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PASSIVE</name>
                  <displayName>PASSIVE</displayName>
                  <description>Controller is in error passive state.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Software reads this flag at runtime to detect when the controller is in error passive.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>BOFLG</name>
              <displayName>Bus-Off Flag</displayName>
              <description>Indicates that the CAN controller has entered bus-off (TX error counter &gt; 255).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <displayName>ACTIVE</displayName>
                  <description>CAN controller is not bus-off.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUS_OFF</name>
                  <displayName>BUS_OFF</displayName>
                  <description>CAN controller is bus-off.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Software reads this flag at runtime to detect bus-off state.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>LERRC</name>
              <displayName>Last Error Code</displayName>
              <description>Records the category of the last detected CAN error. Cleared to 0 on successful transmission/reception.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ERROR</name>
                  <displayName>NO_ERROR</displayName>
                  <description>No error.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT_STUFFING_ERROR</name>
                  <displayName>BIT_STUFFING_ERROR</displayName>
                  <description>Bit stuffing error detected.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORM_ERROR</name>
                  <displayName>FORM_ERROR</displayName>
                  <description>Form error detected.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACK_ERROR</name>
                  <displayName>ACK_ERROR</displayName>
                  <description>ACK error detected.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RECESSIVE_BIT_ERROR</name>
                  <displayName>RECESSIVE_BIT_ERROR</displayName>
                  <description>Recessive bit error detected.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DOMINANT_BIT_ERROR</name>
                  <displayName>DOMINANT_BIT_ERROR</displayName>
                  <description>Dominant bit error detected.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_ERROR</name>
                  <displayName>CRC_ERROR</displayName>
                  <description>CRC error detected.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOFTWARE_SET</name>
                  <displayName>SOFTWARE_SET</displayName>
                  <description>Bit manually set by software.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Software may read or reset this code at runtime for debugging or error handling.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>TXERRCNT</name>
              <displayName>Transmit Error Counter</displayName>
              <description>Reflects the current transmit error counter. When it exceeds 255, the controller enters bus-off.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Software reads this counter at runtime to diagnose CAN transmission reliability.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>RXERRCNT</name>
              <displayName>Receive Error Counter</displayName>
              <description>Reflects the current receive error counter. When it exceeds 127, the controller enters error passive.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Software reads this counter at runtime to diagnose CAN reception reliability.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
