Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/chip_config.svd
        <register>
          <name>FACT</name>
          <displayName>CAN Filter Activation Register</displayName>
          <description>
            The CAN_FACT register enables or disables each of the 28 CAN filters on a bit-by-bit basis. Each bit FACTi (where i
            ranges from 0 to 27) corresponds to a specific filter. Setting FACTi to 1 activates that filter, while clearing it
            to 0 disables the filter. Only filters that are active will be applied when the CAN module checks incoming messages
            against the configured filter criteria. This register can be modified only when the CAN filter initialization mode
            (FINITEN in CAN_FCTRL) is enabled or if the filter is deactivated.
          </description>
          <addressOffset>0x21C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field><name>FACT0</name><description>Filter active</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FACT1</name><description>Filter active</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FACT2</name><description>Filter active</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FACT3</name><description>Filter active</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FACT4</name><description>Filter active</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FACT5</name><description>Filter active</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FACT6</name><description>Filter active</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FACT7</name><description>Filter active</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FACT8</name><description>Filter active</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FACT9</name><description>Filter active</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FACT10</name><description>Filter active</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FACT11</name><description>Filter active</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FACT12</name><description>Filter active</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FACT13</name><description>Filter active</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FACT14</name><description>Filter active</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FACT15</name><description>Filter active</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FACT16</name><description>Filter active</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FACT17</name><description>Filter active</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FACT18</name><description>Filter active</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FACT19</name><description>Filter active</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FACT20</name><description>Filter active</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FACT21</name><description>Filter active</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FACT22</name><description>Filter active</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FACT23</name><description>Filter active</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FACT24</name><description>Filter active</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FACT25</name><description>Filter active</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FACT26</name><description>Filter active</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FACT27</name><description>Filter active</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
          <vendorExtensions>
            <embeetle:registerKind>setting</embeetle:registerKind>
            <embeetle:registerKindCmt>
              Each bit in this register enables or disables a specific filter. Activating or
              deactivating filters is typically performed during initialization or reconfiguration,
              so this register is regarded as a 'setting' register.
            </embeetle:registerKindCmt>
          </vendorExtensions>
        </register>
        <register>
          <name>FCTRL</name>
          <displayName>CAN Filter Control Register</displayName>
          <description>
            Controls the CAN filter initialization mode and the start bank for CAN2.
            When FINITEN is set, the filters are in initialization mode (allowing the
            user to configure them). The CAN2SB bits specify at which filter bank CAN2
            begins using filters, effectively splitting the filter banks between CAN1
            and CAN2.
          </description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x2A1C0E01</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FINITEN</name>
              <displayName>Filter Initialization Enable</displayName>
              <description>
                Selects whether the filter unit is placed in initialization mode (1) or
                normal mode (0). In initialization mode, filter registers can be
                modified; in normal mode, the filter hardware is active.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <displayName>Normal mode</displayName>
                  <description>Filters operate normally (no initialization).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INIT</name>
                  <displayName>Initialization mode</displayName>
                  <description>Filters remain in initialization mode (registers can be modified).</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  This bit is typically set during CAN filter configuration (initialization).
                  Once filters are configured, software usually clears it to enter normal mode.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>CAN2SB</name>
              <displayName>CAN2 Start Bank</displayName>
              <description>
                Specifies the first filter bank used by CAN2, in the range 0..27 (or 28
                in some devices). A value of 0 means all filter banks belong to CAN2,
                while a value of 28 can mean all filter banks belong to CAN1. Intermediate
                values split the filters between CAN1 and CAN2.
              </description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALL_TO_CAN2</name>
                  <displayName>All filters for CAN2</displayName>
                  <description>When 0, all filter banks are allocated to CAN2.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL_TO_CAN1</name>
                  <displayName>All filters for CAN1</displayName>
                  <description>When 28, all filter banks are allocated to CAN1 (if supported on this device).</description>
                  <value>28</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  This field is typically configured once during CAN initialization,
                  to define filter distribution between CAN1 and CAN2.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>FFASS</name>
          <displayName>CAN Filter FIFO ASSociation Register</displayName>
          <description>
            The FFASS register is used to decide whether each of the 28 CAN filters is linked to Receive FIFO 0 or Receive FIFO 1. Each bit FFASSi
            (where i ranges from 0 to 27) corresponds to a particular filter. If FFASSi is 0, the filter routes matching messages to FIFO 0; if
            FFASSi is 1, it routes them to FIFO 1. This register can be updated only when the filter initialization mode is enabled (FINITEN bit in
            CAN_FCTRL = 1).
          </description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field><name>FFASS0</name><description>Filter FIFO assignment for filter 0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FFASS1</name><description>Filter FIFO assignment for filter 1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FFASS2</name><description>Filter FIFO assignment for filter 2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FFASS3</name><description>Filter FIFO assignment for filter 3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FFASS4</name><description>Filter FIFO assignment for filter 4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FFASS5</name><description>Filter FIFO assignment for filter 5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FFASS6</name><description>Filter FIFO assignment for filter 6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FFASS7</name><description>Filter FIFO assignment for filter 7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FFASS8</name><description>Filter FIFO assignment for filter 8</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FFASS9</name><description>Filter FIFO assignment for filter 9</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FFASS10</name><description>Filter FIFO assignment for filter 10</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FFASS11</name><description>Filter FIFO assignment for filter 11</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FFASS12</name><description>Filter FIFO assignment for filter 12</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FFASS13</name><description>Filter FIFO assignment for filter 13</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FFASS14</name><description>Filter FIFO assignment for filter 14</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FFASS15</name><description>Filter FIFO assignment for filter 15</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FFASS16</name><description>Filter FIFO assignment for filter 16</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FFASS17</name><description>Filter FIFO assignment for filter 17</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FFASS18</name><description>Filter FIFO assignment for filter 18</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FFASS19</name><description>Filter FIFO assignment for filter 19</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FFASS20</name><description>Filter FIFO assignment for filter 20</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FFASS21</name><description>Filter FIFO assignment for filter 21</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FFASS22</name><description>Filter FIFO assignment for filter 22</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FFASS23</name><description>Filter FIFO assignment for filter 23</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FFASS24</name><description>Filter FIFO assignment for filter 24</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FFASS25</name><description>Filter FIFO assignment for filter 25</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FFASS26</name><description>Filter FIFO assignment for filter 26</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FFASS27</name><description>Filter FIFO assignment for filter 27</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
          <vendorExtensions>
            <embeetle:registerKind>setting</embeetle:registerKind>
            <embeetle:registerKindCmt>
              This register configures which FIFO each filter belongs to and can only be modified in filter initialization mode. It's typically set once
              during initialization rather than changed during normal operation, so it's best classified as a "setting" register.
            </embeetle:registerKindCmt>
          </vendorExtensions>
        </register>
        <register>
          <name>FMCFG</name>
          <displayName>CAN Filter Mode ConFiGuration Register</displayName>
          <description></description>
          <description>
            The FMCFG register determines the filtering mode for each of the 28 CAN filters. Bits FMCFGx (where x ranges from 0 to 27) select whether
            the corresponding filter uses 0: Identifier Mask Bit Mode or 1: Identifier List Mode. This register can be modified only when the filter
            initialization mode is enabled (FINITEN bit in CAN_FCTRL = 1).
          </description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field><name>FMCFG0</name><description>Filter mode</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FMCFG1</name><description>Filter mode</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FMCFG2</name><description>Filter mode</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FMCFG3</name><description>Filter mode</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FMCFG4</name><description>Filter mode</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FMCFG5</name><description>Filter mode</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FMCFG6</name><description>Filter mode</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FMCFG7</name><description>Filter mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FMCFG8</name><description>Filter mode</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FMCFG9</name><description>Filter mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FMCFG10</name><description>Filter mode</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FMCFG11</name><description>Filter mode</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FMCFG12</name><description>Filter mode</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FMCFG13</name><description>Filter mode</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FMCFG14</name><description>Filter mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FMCFG15</name><description>Filter mode</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FMCFG16</name><description>Filter mode</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FMCFG17</name><description>Filter mode</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FMCFG18</name><description>Filter mode</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FMCFG19</name><description>Filter mode</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FMCFG20</name><description>Filter mode</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FMCFG21</name><description>Filter mode</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FMCFG22</name><description>Filter mode</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FMCFG23</name><description>Filter mode</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FMCFG24</name><description>Filter mode</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FMCFG25</name><description>Filter mode</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FMCFG26</name><description>Filter mode</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FMCFG27</name><description>Filter mode</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
          <vendorExtensions>
            <embeetle:registerKind>setting</embeetle:registerKind>
            <embeetle:registerKindCmt>
              This register configures how each CAN filter operates (mask mode vs. list mode). Since filter modes are determined
              during initialization and not typically altered during normal operation, this register fits better as a "setting"
              register.
            </embeetle:registerKindCmt>
          </vendorExtensions>
        </register>
