Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/chip_config.svd
        <register>
          <name>FSCFG</name>
          <displayName>Filter Scale ConFiGuration Register</displayName>
          <description>
            The CAN_FSCFG register configures the bit width (scale) of each of the 28 CAN filters. Each bit FSCFGx (0 to 27) sets
            whether the corresponding filter operates in two 16-bit segments (FSCFGx=0) or uses one 32-bit segment (FSCFGx=1). You
            can modify this register only when filter initialization mode is active (FINITEN bit in CAN_FCTRL = 1).
          </description>
          <addressOffset>0x20C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field><name>FSCFG0</name><description>Filter bit</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FSCFG1</name><description>Filter bit</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FSCFG2</name><description>Filter bit</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FSCFG3</name><description>Filter bit</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FSCFG4</name><description>Filter bit</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FSCFG5</name><description>Filter bit</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FSCFG6</name><description>Filter bit</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FSCFG7</name><description>Filter bit</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FSCFG8</name><description>Filter bit</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FSCFG9</name><description>Filter bit</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FSCFG10</name><description>Filter bit</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FSCFG11</name><description>Filter bit</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FSCFG12</name><description>Filter bit</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FSCFG13</name><description>Filter bit</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FSCFG14</name><description>Filter bit</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FSCFG15</name><description>Filter bit</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FSCFG16</name><description>Filter bit</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FSCFG17</name><description>Filter bit</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FSCFG18</name><description>Filter bit</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FSCFG19</name><description>Filter bit</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FSCFG20</name><description>Filter bit</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FSCFG21</name><description>Filter bit</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FSCFG22</name><description>Filter bit</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FSCFG23</name><description>Filter bit</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FSCFG24</name><description>Filter bit</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FSCFG25</name><description>Filter bit</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FSCFG26</name><description>Filter bit</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FSCFG27</name><description>Filter bit</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
          <vendorExtensions>
            <embeetle:registerKind>setting</embeetle:registerKind>
            <embeetle:registerKindCmt>
              This register specifies the bit width for each CAN filter (two 16-bit segments or one 32-bit segment) and is typically
              configured only once at initialization, making it a “setting” register rather than one expected to change at runtime.
            </embeetle:registerKindCmt>
          </vendorExtensions>
        </register>
        <register>
          <name>INTEN</name>
          <displayName>CAN Interrupt Enable Register</displayName>
          <description>
            Enables or disables various CAN interrupt sources, including transmit mailbox empty, receive FIFO events, errors,
            wake-up and sleep transitions.
            </description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXMEIEN</name>
              <displayName>Transmit Mailbox Empty Interrupt Enable</displayName>
              <description>When set, generating an interrupt upon transmission completion (mailbox empty).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <displayName>Disabled</displayName>
                  <description>Interrupt generation disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <displayName>Enabled</displayName>
                  <description>Interrupt generation enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Typically configured in initialization to enable or disable TX mailbox empty interrupts.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>FMIEN0</name>
              <displayName>FIFO0 Message Pending Interrupt Enable</displayName>
              <description>When set, generating an interrupt when the number of messages in FIFO0 becomes nonzero.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <displayName>Disabled</displayName>
                  <description>Interrupt generation disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <displayName>Enabled</displayName>
                  <description>Interrupt generation enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Typically configured in initialization to enable or disable FIFO0 message pending interrupts.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>FFULLIEN0</name>
              <displayName>FIFO0 Full Interrupt Enable</displayName>
              <description>When set, generating an interrupt if FIFO0 has reached its full capacity of three messages.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <displayName>Disabled</displayName>
                  <description>Interrupt generation disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <displayName>Enabled</displayName>
                  <description>Interrupt generation enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Typically configured in initialization to enable or disable FIFO0 full interrupts.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>FOVRIEN0</name>
              <displayName>FIFO0 Overrun Interrupt Enable</displayName>
              <description>When set, generating an interrupt if FIFO0 receives a new message while already full.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <displayName>Disabled</displayName>
                  <description>Interrupt generation disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <displayName>Enabled</displayName>
                  <description>Interrupt generation enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Typically configured in initialization to enable or disable FIFO0 overrun interrupts.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>FMIEN1</name>
              <displayName>FIFO1 Message Pending Interrupt Enable</displayName>
              <description>When set, generating an interrupt when the number of messages in FIFO1 becomes nonzero.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <displayName>Disabled</displayName>
                  <description>Interrupt generation disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <displayName>Enabled</displayName>
                  <description>Interrupt generation enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Typically configured in initialization to enable or disable FIFO1 message pending interrupts.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>FFULLIEN1</name>
              <displayName>FIFO1 Full Interrupt Enable</displayName>
              <description>When set, generating an interrupt if FIFO1 has reached its full capacity of three messages.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <displayName>Disabled</displayName>
                  <description>Interrupt generation disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <displayName>Enabled</displayName>
                  <description>Interrupt generation enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Typically configured in initialization to enable or disable FIFO1 full interrupts.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>FOVRIEN1</name>
              <displayName>FIFO1 Overrun Interrupt Enable</displayName>
              <description>When set, generating an interrupt if FIFO1 receives a new message while already full.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <displayName>Disabled</displayName>
                  <description>Interrupt generation disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <displayName>Enabled</displayName>
                  <description>Interrupt generation enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Typically configured in initialization to enable or disable FIFO1 overrun interrupts.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>ERRWIEN</name>
              <displayName>Error Warning Interrupt Enable</displayName>
              <description>When set, generating an error interrupt if the CAN enters warning status (error count &gt;= 96).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <displayName>Disabled</displayName>
                  <description>Interrupt generation disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <displayName>Enabled</displayName>
                  <description>Interrupt generation enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Typically configured in initialization to enable or disable error warning interrupts.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>ERRPIEN</name>
              <displayName>Error Passive Interrupt Enable</displayName>
              <description>When set, generating an error interrupt if the CAN enters error-passive status (error count &gt; 127).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <displayName>Disabled</displayName>
                  <description>Interrupt generation disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <displayName>Enabled</displayName>
                  <description>Interrupt generation enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Typically configured in initialization to enable or disable error-passive interrupts.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>BOFFIEN</name>
              <displayName>Bus-Off Interrupt Enable</displayName>
              <description>When set, generating an error interrupt if the CAN enters bus-off status (transmit error counter &gt; 255).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <displayName>Disabled</displayName>
                  <description>Interrupt generation disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <displayName>Enabled</displayName>
                  <description>Interrupt generation enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Typically configured in initialization to enable or disable bus-off interrupts.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>LECIEN</name>
              <displayName>Last Error Code Interrupt Enable</displayName>
              <description>When set, generating an error interrupt upon updating the last error code (LERRC).</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <displayName>Disabled</displayName>
                  <description>Interrupt generation disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <displayName>Enabled</displayName>
                  <description>Interrupt generation enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Typically configured in initialization to enable or disable last error code interrupts.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>ERRIEN</name>
              <displayName>Error Interrupt Enable</displayName>
              <description>Global enable for generating error interrupts. If set, the CAN error flags (when the corresponding bits are set) can generate interrupts.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <displayName>Disabled</displayName>
                  <description>Global error interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <displayName>Enabled</displayName>
                  <description>Global error interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Typically configured in initialization to enable or disable CAN global error interrupts.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>WUPIEN</name>
              <displayName>Wakeup Interrupt Enable</displayName>
              <description>When set, generating an interrupt upon waking up from sleep mode.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <displayName>Disabled</displayName>
                  <description>Interrupt generation disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <displayName>Enabled</displayName>
                  <description>Interrupt generation enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Typically configured in initialization to enable or disable wakeup interrupts.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>SLEEPIEN</name>
              <displayName>Sleep Interrupt Enable</displayName>
              <description>When set, generating an interrupt upon entering sleep mode.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <displayName>Disabled</displayName>
                  <description>Interrupt generation disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <displayName>Enabled</displayName>
                  <description>Interrupt generation enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Typically configured in initialization to enable or disable sleep mode interrupts.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
