Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/chip_config.svd
        <register>
          <name>MCTRL</name>
          <displayName>CAN Master Control Register</displayName>
          <description>
            Governs the CAN controller operation modes and configuration, including
            initialization/sleep requests, FIFO lock, automatic retransmission, and
            software reset.
          </description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x00010002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INITREQ</name>
              <displayName>Initialization Request</displayName>
              <description>
                Requests entering initialization mode (1) or exiting it (0). In
                initialization mode, the CAN configuration (bit timing, filters, etc.)
                can be modified. Message reception/transmission is disabled in init mode.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_MODE</name>
                  <displayName>Normal Mode</displayName>
                  <description>Exit initialization mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INIT_MODE</name>
                  <displayName>Initialization Mode</displayName>
                  <description>Enter initialization mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Typically set/cleared during runtime to reconfigure CAN or start normal operation.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>SLEEPREQ</name>
              <displayName>Sleep Request</displayName>
              <description>
                Requests entering sleep mode (1) or exiting it (0). When in sleep mode,
                the CAN clock stops working, reducing power consumption. If AWUPCFG is
                set, the controller can automatically clear this bit upon detecting
                CAN activity.
              </description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLEEPREQ_CLEAR</name>
                  <displayName>Sleep Request Clear</displayName>
                  <description>No sleep request (normal operation).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLEEPREQ_SET</name>
                  <displayName>Sleep Request Set</displayName>
                  <description>Request to enter sleep mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Typically set/cleared during runtime for power management.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>TXFPCFG</name>
              <displayName>Transmit FIFO Priority Configure</displayName>
              <description>
                Determines how priority is chosen when multiple transmit mailboxes are
                pending. 0: Priority by message identifier (lower ID = higher priority).
                1: Priority by transmit request order.
              </description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ID_PRIORITY</name>
                  <displayName>Identifier Priority</displayName>
                  <description>Use message ID to arbitrate priority.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQUEST_PRIORITY</name>
                  <displayName>Request Order Priority</displayName>
                  <description>Use the sequence of transmission requests.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Configured typically once to define mailbox priority scheme.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>RXFLOCK</name>
              <displayName>Receive FIFO Locked Mode Configure</displayName>
              <description>
                Determines FIFO behavior upon overrun. 0: Overwritten by the new message.
                1: New message is discarded when FIFO is full.
              </description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNLOCKED</name>
                  <displayName>Unlocked</displayName>
                  <description>Overwrite oldest message if FIFO is full.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED</name>
                  <displayName>Locked</displayName>
                  <description>Discard new message if FIFO is full.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Configuration bit for how FIFO overrun is handled.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>ARTXMD</name>
              <displayName>Automatic Retransmission Disable</displayName>
              <description>
                Controls automatic retransmission. 0: Retransmit on error or arbitration
                loss until success. 1: Transmit only once.
              </description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUTO_RETX_ENABLED</name>
                  <displayName>Auto Retransmission Enabled</displayName>
                  <description>CAN will keep retrying a failed transmission.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTO_RETX_DISABLED</name>
                  <displayName>Auto Retransmission Disabled</displayName>
                  <description>Transmit only once, no automatic retry.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Configured to enable or disable automatic retransmission.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>AWUPCFG</name>
              <displayName>Automatic Wakeup Mode Configure</displayName>
              <description>
                Selects how the CAN wakes from sleep mode. 0: Software must clear SLEEPREQ.
                1: Hardware automatically clears SLEEPREQ upon detecting CAN traffic.
              </description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SW_WAKEUP</name>
                  <displayName>Software Wakeup</displayName>
                  <description>Exit from sleep requires software to clear SLEEPREQ bit.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HW_WAKEUP</name>
                  <displayName>Hardware Wakeup</displayName>
                  <description>Automatically exit sleep upon receiving CAN message.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Configure wakeup behavior from sleep mode.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>ALBOFFM</name>
              <displayName>Automatic Leaving Bus-Off Mode</displayName>
              <description>
                Determines the condition for recovering from bus-off. 0: Software requests
                init mode then clear it after 128 occurrences of 11 recessive bits.
                1: Hardware automatically recovers from bus-off.
              </description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SOFTWARE</name>
                  <displayName>Software Recovery</displayName>
                  <description>Need to request init mode and clear it to leave bus-off.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTO</name>
                  <displayName>Automatic Recovery</displayName>
                  <description>Hardware automatically recovers from bus-off.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Configures how the CAN controller recovers from bus-off state.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>SWRST</name>
              <displayName>Software Reset</displayName>
              <description>
                Forces a reset of the CAN controller when set to 1. Hardware clears this
                bit automatically once reset is performed, placing CAN in sleep mode.
              </description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_RESET</name>
                  <displayName>No Reset</displayName>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE_RESET</name>
                  <displayName>Force Reset</displayName>
                  <description>Reset the CAN controller, hardware clears this bit.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Set/cleared at runtime to force immediate reset of CAN hardware.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DBGFRZE</name>
              <displayName>Debug Freeze</displayName>
              <description>
                Determines whether the CAN can continue receiving/transmitting during
                debugging. 0: CAN is active, 1: CAN is frozen (no receive/transmit)
                but registers remain accessible.
              </description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <displayName>Debug Freeze Disabled</displayName>
                  <description>CAN continues normal operation in debug mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <displayName>Debug Freeze Enabled</displayName>
                  <description>CAN is frozen (no receive/transmit) during debug mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Typically configured once for debug behavior.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
