Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/chip_config.svd
        <register>
          <name>RXF0</name>
          <displayName>CAN Receive FIFO 0 Register</displayName>
          <description>
            Reflects the current state of FIFO0, including the number of messages stored,
            full/overrun flags, and the release output mailbox control.
          </description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FMNUM0</name>
              <displayName>FIFO0 Message Number</displayName>
              <description>
                Reflects the number of messages currently stored in FIFO0 (0..3).
                Each time a new message is received, this count increases until 3,
                and it decreases by 1 when the software releases a message from FIFO0.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO_MESSAGES</name>
                  <displayName>0 Messages</displayName>
                  <description>FIFO0 is empty.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_MESSAGE</name>
                  <displayName>1 Message</displayName>
                  <description>FIFO0 contains 1 message.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO_MESSAGES</name>
                  <displayName>2 Messages</displayName>
                  <description>FIFO0 contains 2 messages.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE_MESSAGES</name>
                  <displayName>3 Messages</displayName>
                  <description>FIFO0 contains 3 messages (full).</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Read at runtime to see how many messages are queued in FIFO0.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>FFULLFLG0</name>
              <displayName>FIFO0 Full Flag</displayName>
              <description>
                Set by hardware when FIFO0 contains three messages. Cleared by software
                writing 1.
              </description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_FULL</name>
                  <displayName>Not Full</displayName>
                  <description>FIFO0 is not full.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL</name>
                  <displayName>Full</displayName>
                  <description>FIFO0 contains 3 messages.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Typically cleared by writing 1 after processing messages to allow receiving new ones.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>FOVRFLG0</name>
              <displayName>FIFO0 Overrun Flag</displayName>
              <description>
                Set by hardware when a new message arrives while FIFO0 is full. Cleared by
                software writing 1.
              </description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_OVERRUN</name>
                  <displayName>No Overrun</displayName>
                  <description>No overrun has occurred or flag is cleared.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVERRUN_OCCURRED</name>
                  <displayName>Overrun Occurred</displayName>
                  <description>FIFO0 received a new message while already full.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Typically cleared by writing 1 after handling the overrun condition.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>RFOM0</name>
              <displayName>Release FIFO0 Output Mailbox</displayName>
              <description>
                If 1, releases the output mailbox of FIFO0, allowing the next stored message
                to be accessed. Hardware clears this bit to 0 after the release.
              </description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_RELEASE</name>
                  <displayName>No Release</displayName>
                  <description>Output mailbox is not released.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RELEASE</name>
                  <displayName>Release Mailbox</displayName>
                  <description>Frees FIFO0 output mailbox to access next message.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Software writes 1 after reading the top message to advance the FIFO.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>RXF1</name>
          <displayName>CAN Receive FIFO 1 Register</displayName>
          <description>
            Reflects the current state of FIFO1, including the number of messages stored,
            full/overrun flags, and the release output mailbox control.
          </description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FMNUM1</name>
              <displayName>FIFO1 Message Number</displayName>
              <description>
                Reflects the number of messages currently stored in FIFO1 (0..3).
                Each time a new message is received, this count increases until 3,
                and it decreases by 1 when the software releases a message from FIFO1.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO_MESSAGES</name>
                  <displayName>0 Messages</displayName>
                  <description>FIFO1 is empty.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_MESSAGE</name>
                  <displayName>1 Message</displayName>
                  <description>FIFO1 contains 1 message.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO_MESSAGES</name>
                  <displayName>2 Messages</displayName>
                  <description>FIFO1 contains 2 messages.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE_MESSAGES</name>
                  <displayName>3 Messages</displayName>
                  <description>FIFO1 contains 3 messages (full).</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Read at runtime to see how many messages are queued in FIFO1.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>FFULLFLG1</name>
              <displayName>FIFO1 Full Flag</displayName>
              <description>
                Set by hardware when FIFO1 contains three messages. Cleared by software
                writing 1.
              </description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_FULL</name>
                  <displayName>Not Full</displayName>
                  <description>FIFO1 is not full.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL</name>
                  <displayName>Full</displayName>
                  <description>FIFO1 contains 3 messages.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Typically cleared by writing 1 after processing messages to allow receiving new ones.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>FOVRFLG1</name>
              <displayName>FIFO1 Overrun Flag</displayName>
              <description>
                Set by hardware when a new message arrives while FIFO1 is full. Cleared by
                software writing 1.
              </description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_OVERRUN</name>
                  <displayName>No Overrun</displayName>
                  <description>No overrun has occurred or flag is cleared.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVERRUN_OCCURRED</name>
                  <displayName>Overrun Occurred</displayName>
                  <description>FIFO1 received a new message while already full.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Typically cleared by writing 1 after handling the overrun condition.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>RFOM1</name>
              <displayName>Release FIFO1 Output Mailbox</displayName>
              <description>
                If 1, releases the output mailbox of FIFO1, allowing the next stored message
                to be accessed. Hardware clears this bit to 0 after the release.
              </description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_RELEASE</name>
                  <displayName>No Release</displayName>
                  <description>Output mailbox is not released.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RELEASE</name>
                  <displayName>Release Mailbox</displayName>
                  <description>Frees FIFO1 output mailbox to access next message.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>
                  Software writes 1 after reading the top message to advance the FIFO.
                </embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>RXMDH0</name>
          <displayName>CAN Receive Mailbox High Byte Data Register 0</displayName>
          <description>
            Holds the high data bytes (4..7) of the received message in mailbox 0.
          </description>
          <addressOffset>0x1BC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATABYTE4</name>
              <displayName>Data Byte 4</displayName>
              <description>4th data byte of the received message.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Read at runtime to retrieve byte 4 of the CAN frame in mailbox 0.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DATABYTE5</name>
              <displayName>Data Byte 5</displayName>
              <description>5th data byte of the received message.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Read at runtime to retrieve byte 5 of the CAN frame in mailbox 0.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DATABYTE6</name>
              <displayName>Data Byte 6</displayName>
              <description>6th data byte of the received message.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Read at runtime to retrieve byte 6 of the CAN frame in mailbox 0.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DATABYTE7</name>
              <displayName>Data Byte 7</displayName>
              <description>7th data byte of the received message.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Read at runtime to retrieve byte 7 of the CAN frame in mailbox 0.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>RXMDH1</name>
          <displayName>CAN Receive Mailbox High Byte Data Register 1</displayName>
          <description>
            Holds the high data bytes (4..7) of the received message in mailbox 1.
          </description>
          <addressOffset>0x1CC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATABYTE4</name>
              <displayName>Data Byte 4</displayName>
              <description>4th data byte of the received message.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Read at runtime to retrieve byte 4 of the CAN frame in mailbox 1.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DATABYTE5</name>
              <displayName>Data Byte 5</displayName>
              <description>5th data byte of the received message.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Read at runtime to retrieve byte 5 of the CAN frame in mailbox 1.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DATABYTE6</name>
              <displayName>Data Byte 6</displayName>
              <description>6th data byte of the received message.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Read at runtime to retrieve byte 6 of the CAN frame in mailbox 1.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DATABYTE7</name>
              <displayName>Data Byte 7</displayName>
              <description>7th data byte of the received message.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Read at runtime to retrieve byte 7 of the CAN frame in mailbox 1.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>RXMDL0</name>
          <displayName>CAN Receive Mailbox Low Byte Data Register 0</displayName>
          <description>
            Holds the low data bytes (0..3) of the received message in mailbox 0.
          </description>
          <addressOffset>0x1B8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATABYTE0</name>
              <displayName>Data Byte 0</displayName>
              <description>0th data byte of the received message.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Read at runtime to retrieve byte 0 of the CAN frame in mailbox 0.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DATABYTE1</name>
              <displayName>Data Byte 1</displayName>
              <description>1st data byte of the received message.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Read at runtime to retrieve byte 1 of the CAN frame in mailbox 0.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DATABYTE2</name>
              <displayName>Data Byte 2</displayName>
              <description>2nd data byte of the received message.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Read at runtime to retrieve byte 2 of the CAN frame in mailbox 0.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DATABYTE3</name>
              <displayName>Data Byte 3</displayName>
              <description>3rd data byte of the received message.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Read at runtime to retrieve byte 3 of the CAN frame in mailbox 0.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
