Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/chip_config.svd
        <register>
          <name>TXMDL2</name>
          <displayName>CAN Transmit Mailbox Low-Byte Data Register 2</displayName>
          <description>This register holds data bytes [0..3] for the message to be transmitted from mailbox 2. When the mailbox is not idle, these bits are write-protected.</description>
          <addressOffset>0x1A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATABYTE0</name>
              <displayName>Data Byte 0</displayName>
              <description>Contains the first data byte (bits 7..0) of the transmitted message.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Data bytes are filled when preparing the message for transmission at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DATABYTE1</name>
              <displayName>Data Byte 1</displayName>
              <description>Contains the second data byte (bits 15..8) of the transmitted message.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Data bytes are filled when preparing the message for transmission at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DATABYTE2</name>
              <displayName>Data Byte 2</displayName>
              <description>Contains the third data byte (bits 23..16) of the transmitted message.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Data bytes are filled when preparing the message for transmission at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DATABYTE3</name>
              <displayName>Data Byte 3</displayName>
              <description>Contains the fourth data byte (bits 31..24) of the transmitted message.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Data bytes are filled when preparing the message for transmission at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>TXMID0</name>
          <displayName>CAN Transmit Mailbox Identifier Register 0</displayName>
          <description>This register holds the identifier (standard or extended) for the transmitted message, plus bits to request transmission and configure the frame type. It is write-protected while the mailbox is waiting for transmission.</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXMREQ</name>
              <displayName>Transmit Mailbox Data Request</displayName>
              <description>Requests transmission from this mailbox. Cleared by hardware when transmission or abort completes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_REQUEST</name>
                  <displayName>No Request</displayName>
                  <description>No transmit request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQUEST</name>
                  <displayName>Request</displayName>
                  <description>Request to transmit</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Setting this bit is a typical runtime action to start a new transmission.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>TXRFREQ</name>
              <displayName>Transmit Remote Frame Request</displayName>
              <description>Selects whether the transmitted frame is a remote frame (1) or a data frame (0).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA_FRAME</name>
                  <displayName>Data Frame</displayName>
                  <description>Transmit a data frame</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REMOTE_FRAME</name>
                  <displayName>Remote Frame</displayName>
                  <description>Transmit a remote frame</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Choosing frame type is part of sending a message at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>IDTYPESEL</name>
              <displayName>Identifier Type Select</displayName>
              <description>Chooses whether the identifier is standard (11-bit) or extended (29-bit).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STANDARD_ID</name>
                  <displayName>Standard Identifier</displayName>
                  <description>Use 11-bit identifier</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTENDED_ID</name>
                  <displayName>Extended Identifier</displayName>
                  <description>Use 29-bit identifier</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Selecting the identifier type is typically done when preparing a message to send.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>EXTID</name>
              <displayName>Extended Identifier</displayName>
              <description>Holds the lower 18 bits of the extended identifier when IDTYPESEL=1.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This field is set at runtime to define the extended ID of the message.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>STDID</name>
              <displayName>Standard Identifier or Extended Identifier High Bits</displayName>
              <description>When IDTYPESEL=0, these 11 bits hold the standard identifier; when IDTYPESEL=1, they hold bits[28:18] of the extended identifier.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Used at runtime to store the standard ID or the upper portion of the extended ID.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>TXMID1</name>
          <displayName>CAN Transmit Mailbox Identifier Register 1</displayName>
          <description>This register holds the identifier (standard or extended) for the transmitted message, plus bits to request transmission and configure the frame type. It is write-protected while the mailbox is waiting for transmission.</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXMREQ</name>
              <displayName>Transmit Mailbox Data Request</displayName>
              <description>Requests transmission from this mailbox. Cleared by hardware when transmission or abort completes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_REQUEST</name>
                  <displayName>No Request</displayName>
                  <description>No transmit request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQUEST</name>
                  <displayName>Request</displayName>
                  <description>Request to transmit</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Setting this bit is a typical runtime action to start a new transmission.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>TXRFREQ</name>
              <displayName>Transmit Remote Frame Request</displayName>
              <description>Selects whether the transmitted frame is a remote frame (1) or a data frame (0).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA_FRAME</name>
                  <displayName>Data Frame</displayName>
                  <description>Transmit a data frame</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REMOTE_FRAME</name>
                  <displayName>Remote Frame</displayName>
                  <description>Transmit a remote frame</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Choosing frame type is part of sending a message at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>IDTYPESEL</name>
              <displayName>Identifier Type Select</displayName>
              <description>Chooses whether the identifier is standard (11-bit) or extended (29-bit).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STANDARD_ID</name>
                  <displayName>Standard Identifier</displayName>
                  <description>Use 11-bit identifier</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTENDED_ID</name>
                  <displayName>Extended Identifier</displayName>
                  <description>Use 29-bit identifier</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Selecting the identifier type is typically done when preparing a message to send.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>EXTID</name>
              <displayName>Extended Identifier</displayName>
              <description>Holds the lower 18 bits of the extended identifier when IDTYPESEL=1.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This field is set at runtime to define the extended ID of the message.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>STDID</name>
              <displayName>Standard Identifier or Extended Identifier High Bits</displayName>
              <description>When IDTYPESEL=0, these 11 bits hold the standard identifier; when IDTYPESEL=1, they hold bits[28:18] of the extended identifier.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Used at runtime to store the standard ID or the upper portion of the extended ID.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>TXMID2</name>
          <displayName>CAN Transmit Mailbox Identifier Register 2</displayName>
          <description>This register holds the identifier (standard or extended) for the transmitted message, plus bits to request transmission and configure the frame type. It is write-protected while the mailbox is waiting for transmission.</description>
          <addressOffset>0x1A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXMREQ</name>
              <displayName>Transmit Mailbox Data Request</displayName>
              <description>Requests transmission from this mailbox. Cleared by hardware when transmission or abort completes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_REQUEST</name>
                  <displayName>No Request</displayName>
                  <description>No transmit request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQUEST</name>
                  <displayName>Request</displayName>
                  <description>Request to transmit</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Setting this bit is a typical runtime action to start a new transmission.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>TXRFREQ</name>
              <displayName>Transmit Remote Frame Request</displayName>
              <description>Selects whether the transmitted frame is a remote frame (1) or a data frame (0).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA_FRAME</name>
                  <displayName>Data Frame</displayName>
                  <description>Transmit a data frame</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REMOTE_FRAME</name>
                  <displayName>Remote Frame</displayName>
                  <description>Transmit a remote frame</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Choosing frame type is part of sending a message at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>IDTYPESEL</name>
              <displayName>Identifier Type Select</displayName>
              <description>Chooses whether the identifier is standard (11-bit) or extended (29-bit).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STANDARD_ID</name>
                  <displayName>Standard Identifier</displayName>
                  <description>Use 11-bit identifier</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTENDED_ID</name>
                  <displayName>Extended Identifier</displayName>
                  <description>Use 29-bit identifier</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Selecting the identifier type is typically done when preparing a message to send.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>EXTID</name>
              <displayName>Extended Identifier</displayName>
              <description>Holds the lower 18 bits of the extended identifier when IDTYPESEL=1.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This field is set at runtime to define the extended ID of the message.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>STDID</name>
              <displayName>Standard Identifier or Extended Identifier High Bits</displayName>
              <description>When IDTYPESEL=0, these 11 bits hold the standard identifier; when IDTYPESEL=1, they hold bits[28:18] of the extended identifier.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Used at runtime to store the standard ID or the upper portion of the extended ID.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
