Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/chip_config.svd
        <register>
          <name>TXSTS</name>
          <displayName>CAN Transmit Status Register</displayName>
          <description>Provides status for the three transmit mailboxes (request completion, arbitration lost, error flags, abort requests, empty mailboxes, etc.). Certain bits are set or cleared by hardware upon transmission events.</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <protection>n</protection>
          <resetValue>0x1C000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REQCFLG0</name>
              <displayName>Request Completed Flag Mailbox 0</displayName>
              <description>Set by hardware when transmission or abort is completed for mailbox 0. Cleared by writing 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IN_PROGRESS</name>
                  <displayName>In Progress</displayName>
                  <description>Transmission or abort not yet completed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETED</name>
                  <displayName>Completed</displayName>
                  <description>Transmission or abort completed</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Status bit used at runtime to check or clear mailbox 0 completion.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>TXSUSFLG0</name>
              <displayName>Transmission Success Flag Mailbox 0</displayName>
              <description>Set by hardware when the last transmission attempt for mailbox 0 succeeds. Cleared by writing 1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAIL</name>
                  <displayName>Fail</displayName>
                  <description>Last attempt failed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUCCESS</name>
                  <displayName>Success</displayName>
                  <description>Last attempt succeeded</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Status bit used at runtime to check or clear success state for mailbox 0.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>ARBLSTFLG0</name>
              <displayName>Arbitration Lost Flag Mailbox 0</displayName>
              <description>Set by hardware if mailbox 0 loses arbitration. Cleared by writing 1.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_LOSS</name>
                  <displayName>No Loss</displayName>
                  <description>No arbitration lost for mailbox 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOST</name>
                  <displayName>Lost</displayName>
                  <description>Mailbox 0 lost arbitration</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Runtime status used to detect if mailbox 0 lost bus arbitration.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>TXERRFLG0</name>
              <displayName>Transmission Error Flag Mailbox 0</displayName>
              <description>Set by hardware when mailbox 0 fails to transmit. Cleared by writing 1.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ERROR</name>
                  <displayName>No Error</displayName>
                  <description>No transmission error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERROR</name>
                  <displayName>Error</displayName>
                  <description>Transmission failed for mailbox 0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Runtime status used to detect transmit failure on mailbox 0.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>ABREQFLG0</name>
              <displayName>Abort Request Flag Mailbox 0</displayName>
              <description>Software sets this bit to abort a pending transmit request in mailbox 0. Cleared by hardware when no message is waiting or after successful abort.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ABORT</name>
                  <displayName>No Abort</displayName>
                  <description>No abort request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABORT</name>
                  <displayName>Abort</displayName>
                  <description>Abort the current transmit request</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Abort is typically triggered at runtime if needed.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REQCFLG1</name>
              <displayName>Request Completed Flag Mailbox 1</displayName>
              <description>Set by hardware when transmission or abort is completed for mailbox 1. Cleared by writing 1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IN_PROGRESS</name>
                  <displayName>In Progress</displayName>
                  <description>Transmission or abort not yet completed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETED</name>
                  <displayName>Completed</displayName>
                  <description>Transmission or abort completed</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Status bit used at runtime to check or clear mailbox 1 completion.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>TXSUSFLG1</name>
              <displayName>Transmission Success Flag Mailbox 1</displayName>
              <description>Set by hardware when the last transmission attempt for mailbox 1 succeeds. Cleared by writing 1.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAIL</name>
                  <displayName>Fail</displayName>
                  <description>Last attempt failed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUCCESS</name>
                  <displayName>Success</displayName>
                  <description>Last attempt succeeded</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Status bit used at runtime to check or clear success state for mailbox 1.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>ARBLSTFLG1</name>
              <displayName>Arbitration Lost Flag Mailbox 1</displayName>
              <description>Set by hardware if mailbox 1 loses arbitration. Cleared by writing 1.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_LOSS</name>
                  <displayName>No Loss</displayName>
                  <description>No arbitration lost for mailbox 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOST</name>
                  <displayName>Lost</displayName>
                  <description>Mailbox 1 lost arbitration</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Runtime status used to detect if mailbox 1 lost bus arbitration.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>TXERRFLG1</name>
              <displayName>Transmission Error Flag Mailbox 1</displayName>
              <description>Set by hardware when mailbox 1 fails to transmit. Cleared by writing 1.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ERROR</name>
                  <displayName>No Error</displayName>
                  <description>No transmission error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERROR</name>
                  <displayName>Error</displayName>
                  <description>Transmission failed for mailbox 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Runtime status used to detect transmit failure on mailbox 1.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>ABREQFLG1</name>
              <displayName>Abort Request Flag Mailbox 1</displayName>
              <description>Software sets this bit to abort a pending transmit request in mailbox 1. Cleared by hardware when no message is waiting or after successful abort.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ABORT</name>
                  <displayName>No Abort</displayName>
                  <description>No abort request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABORT</name>
                  <displayName>Abort</displayName>
                  <description>Abort the current transmit request</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Abort is typically triggered at runtime if needed.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>REQCFLG2</name>
              <displayName>Request Completed Flag Mailbox 2</displayName>
              <description>Set by hardware when transmission or abort is completed for mailbox 2. Cleared by writing 1.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IN_PROGRESS</name>
                  <displayName>In Progress</displayName>
                  <description>Transmission or abort not yet completed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETED</name>
                  <displayName>Completed</displayName>
                  <description>Transmission or abort completed</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Status bit used at runtime to check or clear mailbox 2 completion.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>TXSUSFLG2</name>
              <displayName>Transmission Success Flag Mailbox 2</displayName>
              <description>Set by hardware when the last transmission attempt for mailbox 2 succeeds. Cleared by writing 1.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAIL</name>
                  <displayName>Fail</displayName>
                  <description>Last attempt failed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUCCESS</name>
                  <displayName>Success</displayName>
                  <description>Last attempt succeeded</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Status bit used at runtime to check or clear success state for mailbox 2.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>ARBLSTFLG2</name>
              <displayName>Arbitration Lost Flag Mailbox 2</displayName>
              <description>Set by hardware if mailbox 2 loses arbitration. Cleared by writing 1.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_LOSS</name>
                  <displayName>No Loss</displayName>
                  <description>No arbitration lost for mailbox 2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOST</name>
                  <displayName>Lost</displayName>
                  <description>Mailbox 2 lost arbitration</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Runtime status used to detect if mailbox 2 lost bus arbitration.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>TXERRFLG2</name>
              <displayName>Transmission Error Flag Mailbox 2</displayName>
              <description>Set by hardware when mailbox 2 fails to transmit. Cleared by writing 1.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ERROR</name>
                  <displayName>No Error</displayName>
                  <description>No transmission error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERROR</name>
                  <displayName>Error</displayName>
                  <description>Transmission failed for mailbox 2</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Runtime status used to detect transmit failure on mailbox 2.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>ABREQFLG2</name>
              <displayName>Abort Request Flag Mailbox 2</displayName>
              <description>Software sets this bit to abort a pending transmit request in mailbox 2. Cleared by hardware when no message is waiting or after successful abort.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ABORT</name>
                  <displayName>No Abort</displayName>
                  <description>No abort request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABORT</name>
                  <displayName>Abort</displayName>
                  <description>Abort the current transmit request</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Abort is typically triggered at runtime if needed.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>EMNUM</name>
              <displayName>Empty Mailbox Number</displayName>
              <description>Indicates the index of an empty mailbox or the next mailbox to be transmitted if not all are empty.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This read-only field is checked at runtime to find or track the next available mailbox.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>TXMEFLG0</name>
              <displayName>Transmit Mailbox 0 Empty Flag</displayName>
              <description>Set by hardware when mailbox 0 is empty. Cleared by hardware when a message is pending.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_EMPTY</name>
                  <displayName>Not Empty</displayName>
                  <description>Message pending in mailbox 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMPTY</name>
                  <displayName>Empty</displayName>
                  <description>Mailbox 0 contains no message</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Used at runtime to check mailbox 0 availability.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>TXMEFLG1</name>
              <displayName>Transmit Mailbox 1 Empty Flag</displayName>
              <description>Set by hardware when mailbox 1 is empty. Cleared by hardware when a message is pending.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_EMPTY</name>
                  <displayName>Not Empty</displayName>
                  <description>Message pending in mailbox 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMPTY</name>
                  <displayName>Empty</displayName>
                  <description>Mailbox 1 contains no message</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Used at runtime to check mailbox 1 availability.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>TXMEFLG2</name>
              <displayName>Transmit Mailbox 2 Empty Flag</displayName>
              <description>Set by hardware when mailbox 2 is empty. Cleared by hardware when a message is pending.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_EMPTY</name>
                  <displayName>Not Empty</displayName>
                  <description>Message pending in mailbox 2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMPTY</name>
                  <displayName>Empty</displayName>
                  <description>Mailbox 2 contains no message</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
