Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/chip_config.svd
                <embeetle:fieldKindCmt>Used at runtime to check mailbox 2 availability.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>LOWESTP0</name>
              <displayName>Lowest Priority Flag Mailbox 0</displayName>
              <description>Indicates mailbox 0 is the lowest priority among mailboxes waiting to transmit (only relevant when multiple mailboxes are pending).</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_LOWEST</name>
                  <displayName>Not Lowest</displayName>
                  <description>Mailbox 0 is not the lowest priority transmitter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOWEST</name>
                  <displayName>Lowest</displayName>
                  <description>Mailbox 0 is the lowest priority transmitter</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Indicates mailbox 0's relative priority at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>LOWESTP1</name>
              <displayName>Lowest Priority Flag Mailbox 1</displayName>
              <description>Indicates mailbox 1 is the lowest priority among mailboxes waiting to transmit (only relevant when multiple mailboxes are pending).</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_LOWEST</name>
                  <displayName>Not Lowest</displayName>
                  <description>Mailbox 1 is not the lowest priority transmitter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOWEST</name>
                  <displayName>Lowest</displayName>
                  <description>Mailbox 1 is the lowest priority transmitter</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Indicates mailbox 1's relative priority at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>LOWESTP2</name>
              <displayName>Lowest Priority Flag Mailbox 2</displayName>
              <description>Indicates mailbox 2 is the lowest priority among mailboxes waiting to transmit (only relevant when multiple mailboxes are pending).</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_LOWEST</name>
                  <displayName>Not Lowest</displayName>
                  <description>Mailbox 2 is not the lowest priority transmitter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOWEST</name>
                  <displayName>Lowest</displayName>
                  <description>Mailbox 2 is the lowest priority transmitter</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Indicates mailbox 2's relative priority at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP1</name>
      <description>Comparator</description>
      <groupName>COMP</groupName>
      <baseAddress>0x40013818</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <registers>
        <register>
          <name>CSTS</name>
          <displayName>CSTS</displayName>
          <description>control and status register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Comparator 1 enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INMCCFG</name>
              <description>Comparator 1 Input Minus Connection Configure</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WMODESEL</name>
              <description>Comparator 1 Window Mode Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTSEL</name>
              <description>Comparator 1 output Selest</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POLCFG</name>
              <description>Comparator 1 Polarity Configure</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTVAL</name>
              <description>Comparator 1 output status</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK</name>
              <description>COMP CSTS Register Lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
