Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/chip_config.svd
        <register>
          <name>DOEPTRS1</name>
          <displayName>DOEPTRS1</displayName>
          <description>device OUT endpoint-1 transfer size register</description>
          <addressOffset>0x330</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EPTRS</name>
              <description>Transfer size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
            </field>
            <field>
              <name>EPPCNT</name>
              <description>Packet count</description>
              <bitOffset>19</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>PID_SPCNT</name>
              <description>Received data PID/SETUP packet count</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DOEPTRS2</name>
          <displayName>DOEPTRS2</displayName>
          <description>device OUT endpoint-2 transfer size register</description>
          <addressOffset>0x350</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EPTRS</name>
              <description>Transfer size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
            </field>
            <field>
              <name>EPPCNT</name>
              <description>Packet count</description>
              <bitOffset>19</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>PID_SPCNT</name>
              <description>Received data PID/SETUP packet count</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DOEPTRS3</name>
          <displayName>DOEPTRS3</displayName>
          <description>device OUT endpoint-3 transfer size register</description>
          <addressOffset>0x370</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EPTRS</name>
              <description>Transfer size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
            </field>
            <field>
              <name>EPPCNT</name>
              <description>Packet count</description>
              <bitOffset>19</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>PID_SPCNT</name>
              <description>Received data PID/SETUP packet count</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DOUTIMASK</name>
          <displayName>DOUTIMASK</displayName>
          <description>OTG_FS device OUT endpoint common interrupt mask register (OTG_FS_DOEPMSK)</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSFCMPM</name>
              <description>Transfer completed interrupt mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EPDISM</name>
              <description>Endpoint disabled interrupt mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SETPCMPM</name>
              <description>SETUP phase done mask</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OTXEMPM</name>
              <description>OUT token received when endpoint disabled mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXIWCTRLM</name>
              <description>Receive Interrupt when Control Mask</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OUTPM</name>
              <description>OUT Packet Error Interrupt Mask</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BABBLEM</name>
              <description>Babble Error Interrupt Mask</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NAKM</name>
              <description>NAK Interrupt Mask</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DSTS</name>
          <displayName>DSTS</displayName>
          <description>OTG_FS device status register (OTG_FS_DSTS)</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <protection>n</protection>
          <resetValue>0x10</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SUSSTS</name>
              <description>Suspend status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENUMSPD</name>
              <description>Enumerated speed</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ERTERR</name>
              <description>Erratic error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOFNUM</name>
              <description>Frame number of the received SOF</description>
              <bitOffset>8</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DVBUSDTIM</name>
          <displayName>DVBUSDTIM</displayName>
          <description>OTG_FS device VBUS discharge time register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x17D7</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VBUSDTIM</name>
              <description>Device VBUS discharge time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DVBUSPTIM</name>
          <displayName>DVBUSPTIM</displayName>
          <description>OTG_FS device VBUS pulsing time register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x5B8</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VBUSPTIM</name>
              <description>Device VBUS pulsing time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
