Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/chip_config.svd
        <register>
          <name>I2SCFG</name>
          <displayName>Inter-IC Sound (I2S) Configuration Register</displayName>
          <description>Configures the I2S parameters. This register is used only in I2S mode (not in SPI mode). Most bits can be written only when I2SEN=0 to avoid conflicts.</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHLEN</name>
              <displayName>Channel Length</displayName>
              <description>Selects the number of bits per audio channel. Must be greater than or equal to the data length. Only valid in I2S mode and can be changed only when I2S is disabled (I2SEN=0).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BIT_16</name>
                  <displayName>16-bit channel length</displayName>
                  <description>Each audio channel is 16 bits wide.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT_32</name>
                  <displayName>32-bit channel length</displayName>
                  <description>Each audio channel is 32 bits wide.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Channel length is configured before enabling I2S and remains fixed during operation.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DATALEN</name>
              <displayName>Data Length</displayName>
              <description>Selects the data length for audio samples (16/24/32 bits). If data length is extended to 32 bits, the extra bits are forced to 0 or must be handled in two 16-bit accesses. Only valid in I2S mode and can be changed only when I2S is disabled (I2SEN=0).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>16BIT</name>
                  <displayName>16-bit data length</displayName>
                  <description>Audio sample size is 16 bits.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24BIT</name>
                  <displayName>24-bit data length</displayName>
                  <description>Audio sample size is 24 bits (two 16-bit accesses).</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32BIT</name>
                  <displayName>32-bit data length</displayName>
                  <description>Audio sample size is 32 bits (two 16-bit accesses if using the 16-bit SPI_DATA register).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <displayName>Data length disabled</displayName>
                  <description>Not used; data length is disabled.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Data length is chosen at initialization and typically remains unchanged during I2S operation.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>CPOL</name>
              <displayName>Clock Polarity</displayName>
              <description>Selects the idle state (polarity) of the I2S clock line (CK). This bit can only be configured when I2SEN=0. Not used in SPI mode.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE_LOW</name>
                  <displayName>Idle clock low</displayName>
                  <description>The clock line (CK) is low in idle state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLE_HIGH</name>
                  <displayName>Idle clock high</displayName>
                  <description>The clock line (CK) is high in idle state.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Idle clock polarity is selected prior to enabling I2S; not typically changed on the fly.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>I2SSSEL</name>
              <displayName>I2S Standard Selection</displayName>
              <description>Selects the audio standard: I2S Philips, MSB alignment, LSB alignment, or PCM. This bit can only be configured when I2SEN=0, and is not used in SPI mode.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PHILIPS</name>
                  <displayName>I2S Philips standard</displayName>
                  <description>Uses the Philips I2S standard (WS toggles one bit before data).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSB_ALIGN</name>
                  <displayName>MSB-alignment (left-justified)</displayName>
                  <description>Uses the MSB alignment standard.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSB_ALIGN</name>
                  <displayName>LSB-alignment (right-justified)</displayName>
                  <description>Uses the LSB alignment standard.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCM</name>
                  <displayName>PCM standard</displayName>
                  <description>Uses the PCM short/long frame standard.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Audio protocol is configured before operation and remains unchanged once streaming begins.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>PFSSEL</name>
              <displayName>PCM Frame Sync Mode</displayName>
              <description>Selects short- or long-frame synchronization when PCM standard (I2SSSEL=11) is used. Not used for other standards. Can only be set when I2SEN=0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SHORT</name>
                  <displayName>Short frame sync</displayName>
                  <description>Synchronization pulse is 1 bit wide (short frame).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LONG</name>
                  <displayName>Long frame sync</displayName>
                  <description>Synchronization pulse is 13 bits wide (long frame).</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Frame sync size is a fundamental setup selected before I2S is enabled (only for PCM).</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>I2SMOD</name>
              <displayName>Master/Slave Transmit/Receive Mode</displayName>
              <description>Selects I2S master or slave, and TX or RX (So one of these four options: Slave Transmit, Slave Receive, Master Transmit or Master Receive). Can only be changed when I2SEN=0. Not used in SPI mode.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLAVE_TX</name>
                  <displayName>Slave transmit</displayName>
                  <description>I2S operates as slave, transmitting data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLAVE_RX</name>
                  <displayName>Slave receive</displayName>
                  <description>I2S operates as slave, receiving data.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTER_TX</name>
                  <displayName>Master transmit</displayName>
                  <description>I2S operates as master, transmitting data.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTER_RX</name>
                  <displayName>Master receive</displayName>
                  <description>I2S operates as master, receiving data.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>The master/slave role and TX/RX direction are configured before enabling the interface.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>I2SEN</name>
              <displayName>I2S Enable</displayName>
              <description>Enables or disables the I2S module for audio communication. This bit can be toggled at runtime to start or stop I2S. All other configuration bits must be stable before enabling I2S.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <displayName>I2S disabled</displayName>
                  <description>The I2S module is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <displayName>I2S enabled</displayName>
                  <description>The I2S module is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Similar to SPIEN; can be set or cleared to enable/disable I2S at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>MODESEL</name>
              <displayName>SPI/I2S Mode Select</displayName>
              <description>Selects whether the peripheral works in SPI mode or I2S mode. Must be set before enabling the peripheral; not allowed to change on the fly.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPI</name>
                  <displayName>SPI mode</displayName>
                  <description>The peripheral operates in SPI mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S</name>
                  <displayName>I2S mode</displayName>
                  <description>The peripheral operates in I2S mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This must be set before enabling the peripheral and cannot be changed once active.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>I2SPSC</name>
          <displayName>I2S (Inter-IC Sound) Prescaler Register</displayName>
          <description>The I2S prescaler register is used to configure the I2S clock prescaler to generate the correct audio sampling frequency. It is only valid in I2S mode (not used in SPI mode). The register must not be modified when the I2S is enabled (I2SEN=1). In particular, I2SPSC must not be set to 0 or 1.</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <!--
            According to the reference manual, the reset value is 0x0002 (0x2).
            This differs from the original SVD file, where the reset value was 0xA.
          -->
          <resetValue>0x0002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>I2SPSC</name>
              <displayName>I2S Linear Prescaler</displayName>
              <description>Specifies the integer part of the I2S prescaler. Must not be 0 or 1. Can only be changed when I2SEN=0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This prescaler value is set before the I2S is enabled to define the desired audio sampling frequency.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>ODDPSC</name>
              <displayName>Odd Prescaler Factor</displayName>
              <description>Determines whether the prescaler factor is multiplied by 2 or by (2 + 1). Can only be changed when I2SEN=0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EVEN</name>
                  <displayName>EVEN</displayName>
                  <description>Prescaler factor = I2SPSC * 2.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ODD</name>
                  <displayName>ODD</displayName>
                  <description>Prescaler factor = (I2SPSC * 2) + 1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Also a prescaler configuration bit that must be set before enabling I2S to achieve the correct audio clock.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>MCOEN</name>
              <displayName>Master Clock Output Enable</displayName>
              <description>Enables or disables the extra master clock output pin in I2S master mode.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <displayName>DISABLE</displayName>
                  <description>Master clock output is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <displayName>ENABLE</displayName>
                  <description>Master clock output is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This is configured prior to operation if an external MCLK is needed. Not typically changed on the fly.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCRC</name>
          <displayName>SPI Receive CRC Register</displayName>
          <description>This register stores the hardware-calculated CRC of the data received in SPI mode. The width of this CRC matches the SPI data frame width (CRC8 if 8 bits, CRC16 if 16 bits). It is cleared by hardware when the CRCEN bit in SPI_CTRL1 is set. Not used in I2S mode. If the BSYFLG bit is set, reading this register may yield invalid data.</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXCRC</name>
              <displayName>Receive Data CRC Value</displayName>
              <description>Holds the CRC result of the received data in SPI mode. The field width follows the configured data frame. Cleared by hardware when CRCEN is set. Not used in I2S mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This field is updated at runtime by hardware (SPI CRC engine), and read at runtime to verify the integrity of received data.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
