Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/chip_config.svd
        <register>
          <name>CTRL2</name>
          <displayName>Serial Peripheral Interface Control Register 2</displayName>
          <description>This register provides advanced control features for the SPI peripheral, such as enabling DMA requests, configuring the SS (NSS) output, selecting the SPI frame format (Motorola or TI mode) and enabling interrupts for various SPI-related events.</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDEN</name>
              <displayName>Receive DMA Enable</displayName>
              <description>Enables or disables the DMA request when the RX buffer is not empty.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <displayName>DISABLE</displayName>
                  <description>DMA request for receive is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <displayName>ENABLE</displayName>
                  <description>DMA request for receive is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Typically enabled/disabled once during initialization to define how RX data is handled.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>TXDEN</name>
              <displayName>Transmit DMA Enable</displayName>
              <description>Enables or disables the DMA request when the TX buffer is empty.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <displayName>DISABLE</displayName>
                  <description>DMA request for transmit is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <displayName>ENABLE</displayName>
                  <description>DMA request for transmit is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Typically enabled/disabled once during initialization to define how TX data is handled.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>SSOEN</name>
              <displayName>SS (NSS) Output Enable</displayName>
              <description>Enables or disables the SS (NSS) output when operating in master mode.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <displayName>DISABLE</displayName>
                  <description>SS (NSS) output is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <displayName>ENABLE</displayName>
                  <description>SS (NSS) output is enabled in master mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Usually configured at initialization in master mode to determine if NSS is driven automatically.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>FRFCFG</name>
              <displayName>Frame Format Configure</displayName>
              <description>Selects SPI Motorola mode (FRFCFG=0) or SPI TI mode (FRFCFG=1).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MOTOROLA</name>
                  <displayName>MOTOROLA</displayName>
                  <description>SPI Motorola frame format.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TI</name>
                  <displayName>TI</displayName>
                  <description>SPI TI frame format.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Format is chosen prior to communication and isn't typically changed at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>ERRIEN</name>
              <displayName>Error Interrupt Enable</displayName>
              <description>Enables or disables interrupts for SPI error flags (e.g., overrun or CRC errors).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <displayName>DISABLE</displayName>
                  <description>Error interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <displayName>ENABLE</displayName>
                  <description>Error interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Error interrupts are usually enabled/disabled once in an initialization routine.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>RXBNEIEN</name>
              <displayName>RX Buffer Not Empty Interrupt Enable</displayName>
              <description>Enables or disables the interrupt when the RX buffer becomes non-empty.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <displayName>DISABLE</displayName>
                  <description>RX buffer not empty interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <displayName>ENABLE</displayName>
                  <description>RX buffer not empty interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Interrupt usage is generally configured at initialization depending on the desired event handling.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>TXBEIEN</name>
              <displayName>TX Buffer Empty Interrupt Enable</displayName>
              <description>Enables or disables the interrupt when the TX buffer becomes empty.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <displayName>DISABLE</displayName>
                  <description>TX buffer empty interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <displayName>ENABLE</displayName>
                  <description>TX buffer empty interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This interrupt is typically enabled or disabled once, according to whether TX events are needed.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA</name>
          <displayName>DATA</displayName>
          <description>data register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <displayName>Transmit/Receive Data</displayName>
              <description>Writes go to the transmit buffer; reads come from the receive buffer. For an 8-bit frame, only the lower 8 bits are used. For a 16-bit frame, all 16 bits are used.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This register is used continuously during operation to send and receive data.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
