Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/chip_config.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SPI3</name>
      <description>Serial peripheral interface</description>
      <groupName>SPI</groupName>
      <baseAddress>0x40003C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <interrupt>
        <name>SPI3</name>
        <description>SPI3 global interrupt</description>
        <value>51</value>
      </interrupt>
      <registers>
        <register>
          <name>CRCPOLY</name>
          <displayName>SPI CRC Polynomial Register</displayName>
          <description>This register holds the CRC (Cyclic Redundancy Check) polynomial used for hardware-based CRC computations in SPI mode. Only the lower 16 bits are valid for defining the polynomial. This register is not used in I2S mode.</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x7</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CRCPOLY</name>
              <displayName>Cyclic Redundancy Check Polynomial Value</displayName>
              <description>This field specifies the polynomial for CRC computation (SPI mode only). When enabled via CRCEN, the hardware will use this polynomial to calculate and check the transmitted/received data. It is not used in I2S mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This bitfield is typically configured once during SPI initialization to set the CRC polynomial.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL1</name>
          <displayName>Serial Peripheral Interface Control Register 1</displayName>
          <description>This register is used to configure fundamental SPI parameters, including clock phase/polarity, master/slave selection, data frame format, and bidirectional mode settings. It is only used in SPI mode and not available when I2S mode is enabled.</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPHA</name>
              <displayName>Clock Phase</displayName>
              <description>Configures the clock phase used for data sampling; cannot be changed during an ongoing communication.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIRST_EDGE</name>
                  <displayName>FIRST_EDGE</displayName>
                  <description>Data is sampled on the first clock edge (odd edge).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECOND_EDGE</name>
                  <displayName>SECOND_EDGE</displayName>
                  <description>Data is sampled on the second clock edge (even edge).</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This bit cannot be changed during an ongoing communication, so it's typically configured once at initialization.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>CPOL</name>
              <displayName>Clock Polarity</displayName>
              <description>Determines the idle state of the SCK line; cannot be changed during an ongoing communication.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE_LOW</name>
                  <displayName>IDLE_LOW</displayName>
                  <description>SCK is low level in idle state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLE_HIGH</name>
                  <displayName>IDLE_HIGH</displayName>
                  <description>SCK is high level in idle state.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This bit is also locked during communication, so it's typically set once before the SPI is enabled.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>MSMCFG</name>
              <displayName>Master/Slave Mode Config</displayName>
              <description>Selects master (MSMCFG=1) or slave (MSMCFG=0) mode operation; must be set before communication starts.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLAVE</name>
                  <displayName>SLAVE</displayName>
                  <description>Device operates in slave mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTER</name>
                  <displayName>MASTER</displayName>
                  <description>Device operates in master mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Mode selection must be done prior to communication and cannot change mid-transmission.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>BRSEL</name>
              <displayName>Baud Rate Prescaler</displayName>
              <description>Sets the SPI clock prescaler, defining the baud rate as f_PCLK / (2^(BRSEL+1)) for these discrete options.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV2</name>
                  <displayName>DIV2</displayName>
                  <description>f_PCLK / 2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <displayName>DIV4</displayName>
                  <description>f_PCLK / 4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <displayName>DIV8</displayName>
                  <description>f_PCLK / 8</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <displayName>DIV16</displayName>
                  <description>f_PCLK / 16</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32</name>
                  <displayName>DIV32</displayName>
                  <description>f_PCLK / 32</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV64</name>
                  <displayName>DIV64</displayName>
                  <description>f_PCLK / 64</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV128</name>
                  <displayName>DIV128</displayName>
                  <description>f_PCLK / 128</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV256</name>
                  <displayName>DIV256</displayName>
                  <description>f_PCLK / 256</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>The baud rate prescaler cannot be changed on the fly; it's set beforehand.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>SPIEN</name>
              <displayName>SPI Enable</displayName>
              <description>Enables or disables the SPI peripheral for communication.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <displayName>DISABLE</displayName>
                  <description>SPI peripheral is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <displayName>ENABLE</displayName>
                  <description>SPI peripheral is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This bit is commonly toggled to start or stop SPI communication in normal operation.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>LSBSEL</name>
              <displayName>LSB First Select</displayName>
              <description>Determines whether data is transmitted with MSB-first or LSB-first ordering.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MSB_FIRST</name>
                  <displayName>MSB_FIRST</displayName>
                  <description>MSB is transmitted first.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSB_FIRST</name>
                  <displayName>LSB_FIRST</displayName>
                  <description>LSB is transmitted first.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Typically set once before communication starts; changing data order mid-communication is not advised.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>ISSEL</name>
              <displayName>Internal NSS Level</displayName>
              <description>Sets the internal NSS level when software NSS mode is enabled.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NSS_LOW</name>
                  <displayName>NSS_LOW</displayName>
                  <description>Internal NSS is driven low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSS_HIGH</name>
                  <displayName>NSS_HIGH</displayName>
                  <description>Internal NSS is driven high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>In software NSS mode, user code may toggle NSS at runtime to control slave selection.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>SSEN</name>
              <displayName>Software NSS Enable</displayName>
              <description>Enables or disables software slave management (SSM) for controlling NSS.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <displayName>DISABLE</displayName>
                  <description>Software slave management disabled; external NSS is used.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <displayName>ENABLE</displayName>
                  <description>Software slave management enabled; internal NSS is used.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Typically configured once depending on whether hardware or software NSS control is desired.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>RXOMEN</name>
              <displayName>Receive-Only Mode Enable</displayName>
              <description>Enables full-duplex (transmit/receive) or receive-only mode on the SPI lines.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FULL_DUPLEX</name>
                  <displayName>FULL_DUPLEX</displayName>
                  <description>Full-duplex transmit and receive.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RECEIVE_ONLY</name>
                  <displayName>RECEIVE_ONLY</displayName>
                  <description>Receive-only mode (MOSI is unused).</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This determines whether SPI transmits data or not, typically set before enabling the peripheral.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>DFLSEL</name>
              <displayName>Data Frame Format Select</displayName>
              <description>Selects either 8-bit or 16-bit data frame format for SPI transmissions.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BIT_8</name>
                  <displayName>BIT_8</displayName>
                  <description>8-bit data frame format.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT_16</name>
                  <displayName>BIT_16</displayName>
                  <description>16-bit data frame format.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Data length must be set before communication begins and cannot be changed on the fly.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>CRCNXT</name>
              <displayName>CRC Transfer Next</displayName>
              <description>Indicates whether the next transmitted data is sourced from the TX buffer or the CRC register.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TX_BUFFER</name>
                  <displayName>TX_BUFFER</displayName>
                  <description>Next transmitted data is taken from the TX buffer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_REG</name>
                  <displayName>CRC_REGISTER</displayName>
                  <description>Next transmitted data is taken from the CRC register.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This is used when appending CRC after sending all data, so it may be changed during normal operation.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>CRCEN</name>
              <displayName>CRC Calculation Enable</displayName>
              <description>Enables or disables the hardware-based CRC calculation for SPI in full-duplex mode.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <displayName>DISABLE</displayName>
                  <description>CRC calculation is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <displayName>ENABLE</displayName>
                  <description>CRC calculation is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Must be enabled or disabled prior to communication, typically only changed when SPI is not active.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>BMOEN</name>
              <displayName>Bidirectional Mode Output Enable</displayName>
              <description>Selects output (TX-only) or input (RX-only) when in single-line bidirectional mode.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INPUT</name>
                  <displayName>INPUT</displayName>
                  <description>Bidirectional line is used for input only.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT</name>
                  <displayName>OUTPUT</displayName>
                  <description>Bidirectional line is used for output only.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Determines direction in single-line mode, set before the communication begins.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>BMEN</name>
              <displayName>Bidirectional Data Mode Enable</displayName>
              <description>Enables single-line bidirectional mode (BMEN=1) or two-line unidirectional mode (BMEN=0).</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TWO_LINE</name>
                  <displayName>TWO_LINE</displayName>
                  <description>Two-line unidirectional mode enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIDIRECTIONAL</name>
                  <displayName>BIDIRECTIONAL</displayName>
                  <description>Single-line bidirectional mode enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Choosing single-line or two-line mode is a fundamental configuration done before enabling SPI.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
