Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/chip_config.svd
        <register>
          <name>STS</name>
          <displayName>SPI/I2S Status Register</displayName>
          <description>This register contains various status flags for SPI or I2S operation, such as buffer flags (transmit, receive), error flags (overrun, underrun, CRC error, mode fault, TI/I2S frame error), busy flag, and left/right channel indication.</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <protection>n</protection>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXBNEFLG</name>
              <displayName>Receive Buffer Not Empty Flag</displayName>
              <description>Indicates that the receive buffer contains valid data. In SPI mode, it is cleared by reading the SPI_DATA register. In I2S mode, it is cleared by reading the same data register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMPTY</name>
                  <displayName>Empty</displayName>
                  <description>The receive buffer is empty (no new data)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTEMPTY</name>
                  <displayName>Not Empty</displayName>
                  <description>The receive buffer contains valid data</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This flag is continuously updated by hardware and read by software during runtime to check if new data has been received.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>TXBEFLG</name>
              <displayName>Transmit Buffer Empty Flag</displayName>
              <description>Indicates that the transmit buffer is empty and can accept new data. In SPI/I2S mode, it is set by hardware after the data moves to the shift register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTEMPTY</name>
                  <displayName>Not Empty</displayName>
                  <description>The transmit buffer currently holds data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMPTY</name>
                  <displayName>Empty</displayName>
                  <description>The transmit buffer is empty and ready for new data</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This flag is continuously updated by hardware and read by software during runtime to know when it can write new data into the transmit buffer.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>SCHDIR</name>
              <displayName>Sound Channel Direction</displayName>
              <description>Indicates whether the current data sample being transmitted or received belongs to the left or right audio channel (for I2S Philips/MSB/LSB modes). Not used in PCM standard.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEFT</name>
                  <displayName>Left Channel</displayName>
                  <description>Data is for the left audio channel</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RIGHT</name>
                  <displayName>Right Channel</displayName>
                  <description>Data is for the right audio channel</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This flag is set by hardware (based on WS signal) and read at runtime to identify which channel is active.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>UDRFLG</name>
              <displayName>Underrun Flag</displayName>
              <description>Indicates an underrun error has occurred (mainly in I2S slave transmit mode) if the application fails to provide data in time.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_UNDERRUN</name>
                  <displayName>No Underrun</displayName>
                  <description>No underrun error occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNDERRUN</name>
                  <displayName>Underrun</displayName>
                  <description>Data was not written in time, causing an underrun</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This flag is updated by hardware when the transmit buffer underruns. Software checks it at runtime to detect errors.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>CRCEFLG</name>
              <displayName>CRC Error Flag</displayName>
              <description>Indicates that the received CRC does not match the computed CRC in SPI mode. 0 = match (no CRC error), 1 = CRC error occurred. Cleared by writing 0 to this bit. Not used in I2S mode.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOERROR</name>
                  <displayName>No CRC Error</displayName>
                  <description>The received CRC matches the transmitted CRC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERROR</name>
                  <displayName>CRC Error</displayName>
                  <description>The CRC check failed</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This flag is used at runtime to check if a SPI CRC mismatch has occurred. Cleared by writing 0.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>MEFLG</name>
              <displayName>Master Mode Fault Flag</displayName>
              <description>Indicates a mode fault error in SPI master mode (e.g., NSS pulled low while configured as master). SPI is forced to slave mode if set. Cleared by read/write sequence.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FAULT</name>
                  <displayName>No Fault</displayName>
                  <description>No master mode fault detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAULT</name>
                  <displayName>Fault</displayName>
                  <description>Master mode fault occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This flag is set by hardware if a mode fault condition arises in SPI master mode. Software checks it at runtime.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>OVRFLG</name>
              <displayName>Overrun Flag</displayName>
              <description>Indicates an overrun error occurred, typically when the received data is not read in time (SPI/I2S). Cleared by a read of SPI_DATA followed by a read of STS.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_OVERRUN</name>
                  <displayName>No Overrun</displayName>
                  <description>No unread data was overwritten</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVERRUN</name>
                  <displayName>Overrun</displayName>
                  <description>Previously received data was lost due to not being read in time</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This flag is set at runtime by hardware when received data is overwritten. Software must check and clear it to handle the error.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>BSYFLG</name>
              <displayName>Busy Flag</displayName>
              <description>Indicates that SPI/I2S is actively transmitting or receiving data.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <displayName>Idle</displayName>
                  <description>No current communication</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY</name>
                  <displayName>Busy</displayName>
                  <description>SPI/I2S is transmitting or receiving data</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This flag is updated by hardware at runtime to indicate if communication is ongoing.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
            <field>
              <name>FFERR</name>
              <displayName>TI Frame Format Error Flag</displayName>
              <description>Indicates a frame format error in TI slave mode or a synchronization error in I2S slave mode. Cleared by reading STS.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ERROR</name>
                  <displayName>No Error</displayName>
                  <description>No frame format error detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERROR</name>
                  <displayName>Error</displayName>
                  <description>Frame format or synchronization error has been detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>Hardware updates this flag at runtime if a TI or I2S frame error occurs. Software reads/clears it to detect synchronization loss.</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCRC</name>
          <displayName>SPI Transmit CRC Register</displayName>
          <description>This register stores the hardware-calculated CRC of the data transmitted in SPI mode. Its width matches the SPI data frame width (CRC8 if 8 bits, CRC16 if 16 bits). It is cleared by hardware when the CRCEN bit in SPI_CTRL1 is set. Not used in I2S mode. If the BSYFLG bit is set, reading this register may yield invalid data.</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXCRC</name>
              <displayName>Transmit Data CRC Value</displayName>
              <description>Holds the CRC result of the transmitted data in SPI mode. The field width follows the configured data frame. Cleared by hardware when CRCEN is set. Not used in I2S mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
                <embeetle:fieldKindCmt>This field is continuously updated by hardware and read at runtime to verify the integrity of transmitted data (SPI CRC).</embeetle:fieldKindCmt>
              </vendorExtensions>
            </field>
          </fields>
        </register>
