Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/chip_config.svd
        <register>
          <name>CTRL2</name>
          <displayName>CTRL2</displayName>
          <description>Control Register 2</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <displayName>Address</displayName>
              <description>USART device node address. This bit is valid only in the mute mode of multiprocessor communication, and decides to enter the mute mode or wake up depending on whether the detected address tags are consistent.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
              </vendorExtensions>
            </field>
            <field>
              <name>LBDLCFG</name>
              <displayName>LIN Break Detection Length Configure</displayName>
              <description>Configures the length of LIN break detection: 10 or 11 bits.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>10_BITS</name>
                  <description>10 bits for LIN break detection</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11_BITS</name>
                  <description>11 bits for LIN break detection</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
              </vendorExtensions>
            </field>
            <field>
              <name>LBDIEN</name>
              <displayName>LIN Break Detection Interrupt Enable</displayName>
              <description>Enables or disables interrupts on LIN break detection. Generates an interrupt when the LBDFLG bit is set.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Interrupt enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
              </vendorExtensions>
            </field>
            <field>
              <name>LBCPOEN</name>
              <displayName>Last Bit Clock Pulse Output Enable</displayName>
              <description>Enables or disables the output of the clock pulse for the last data bit in synchronous mode. This bit does not exist on UART4 or UART5.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
              </vendorExtensions>
            </field>
            <field>
              <name>CPHA</name>
              <displayName>Clock Phase</displayName>
              <description>Indicates on which clock edge data sampling is conducted in synchronous mode. This bit does not exist on UART4 or UART5.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIRST_EDGE</name>
                  <description>Data sampling on the first clock edge</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECOND_EDGE</name>
                  <description>Data sampling on the second clock edge</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
              </vendorExtensions>
            </field>
            <field>
              <name>CPOL</name>
              <displayName>Clock Polarity</displayName>
              <description>Sets the state of the CK pin when the USART is idle in synchronous mode. This bit does not exist on UART4 or UART5.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Idle state is low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Idle state is high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
              </vendorExtensions>
            </field>
            <field>
              <name>CLKEN</name>
              <displayName>Clock Enable</displayName>
              <description>Enables or disables the clock output on the CK pin in synchronous mode. This bit does not exist on UART4 or UART5.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
              </vendorExtensions>
            </field>
            <field>
              <name>STOPCFG</name>
              <displayName>Stop Bit Configuration</displayName>
              <description>Configures the number of stop bits for data transmission. This bit does not exist on UART4 or UART5.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1_STOP</name>
                  <description>1 stop bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_5_STOP</name>
                  <description>0.5 stop bit</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2_STOP</name>
                  <description>2 stop bits</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1_5_STOP</name>
                  <description>1.5 stop bits</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
              </vendorExtensions>
            </field>
            <field>
              <name>LINMEN</name>
              <displayName>LIN Mode Enable</displayName>
              <description>Enables or disables the LIN mode functionality.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>LIN mode disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>LIN mode enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL3</name>
          <displayName>CTRL3</displayName>
          <description>Control register 3</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ERRIEN</name>
              <displayName>Error Interrupt Enable</displayName>
              <description>Error interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Error interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Error interrupt enabled. When DMARXEN is set and one among FEFLG, OVREFLG or NEFLG is set, an interrupt will be generated.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
              </vendorExtensions>
            </field>
            <field>
              <name>IREN</name>
              <displayName>IrDA Function Enable</displayName>
              <description>IrDA Function Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>IrDA disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>IrDA enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
              </vendorExtensions>
            </field>
            <field>
              <name>IRLPEN</name>
              <displayName>IrDA Low-power Mode Enable</displayName>
              <description>IrDA Low-power Mode Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_MODE</name>
                  <description>Normal IrDA mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW_POWER_MODE</name>
                  <description>Low-power IrDA mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
              </vendorExtensions>
            </field>
            <field>
              <name>HDEN</name>
              <displayName>Half-duplex Mode Enable</displayName>
              <description>HDEN bit of USART_CTRL3 register determines whether to enter the single-line half-duplex mode.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Half-duplex mode disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Half-duplex mode enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
              </vendorExtensions>
            </field>
            <field>
              <name>SCNACKEN</name>
              <displayName>NACK Transmit Enable in Smartcard Mode</displayName>
              <description>NACK Transmit Enable During Parity Error in Smartcard Function (This bit does not exist on UART4 or UART5).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_NACK</name>
                  <description>Do not transmit NACK on parity error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NACK_ON_ERROR</name>
                  <description>Transmit NACK on parity error</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
              </vendorExtensions>
            </field>
            <field>
              <name>SCEN</name>
              <displayName>Smartcard Mode Enable</displayName>
              <description>SCEN bit of USART_CTRL3 register decides whether to enter the smart card mode (This bit does not exist on UART4 or UART5).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Smartcard mode disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Smartcard mode enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
              </vendorExtensions>
            </field>
            <field>
              <name>DMARXEN</name>
              <displayName>DMA Receive Enable</displayName>
              <description>DMA Receive Enable (This bit does not exist on UART4 or UART5).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>DMA receiver disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>DMA receiver enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
              </vendorExtensions>
            </field>
            <field>
              <name>DMATXEN</name>
              <displayName>DMA Transmit Enable</displayName>
              <description>DMA Transmit Enable (This bit does not exist on UART4 or UART5).</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>DMA transmitter disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>DMA transmitter enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
              </vendorExtensions>
            </field>
            <field>
              <name>RTSEN</name>
              <displayName>RTS Hardware Flow Control Enable</displayName>
              <description>RTS Hardware Flow Control Function Enable. RTS: 'Request To Send', which is an output signal indicating readiness to receive. This request to receive data is only made when there is space in the receive buffer: when data can be received, the RTS output is pulled to low. (This bit does not exist on UART4 or UART5).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>RTS flow control disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>RTS flow control enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
              </vendorExtensions>
            </field>
            <field>
              <name>CTSEN</name>
              <displayName>CTS Hardware Flow Control Enable</displayName>
              <description>CTS Hardware Flow Control Function Enable. CTS: 'Clear To Send', which is an input signal. Only when CTS input signal is low, the data can be transmitted; otherwise, the data cannot be transmitted. If CTS signal is pulled high during data transmission, the data transmission will be stopped after completion. If write operation is performed for the data register when CTS is high, the data will not be transmitted until CTS is valid. (This bit does not exist on UART4 or UART5).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>CTS flow control disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>CTS flow control enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
              </vendorExtensions>
            </field>
            <field>
              <name>CTSIEN</name>
              <displayName>CTS Interrupt Enable</displayName>
              <description>CTS Interrupt Enable: An interrupt will be generated when CTSFLG is set. (This bit does not exist on UART4 or UART5).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>CTS interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>CTS interrupt enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
              </vendorExtensions>
            </field>
            <field>
              <name>SAMCFG</name>
              <displayName>Sample Method Configure</displayName>
              <description>Sample Method Configure. This bit can be set only when USART is not enabled.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THREE_SAMPLE</name>
                  <description>Sampling for three times</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLE_SAMPLE</name>
                  <description>Single sampling; flag of noise detection disabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA</name>
          <displayName>DATA</displayName>
          <description>Data register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <displayName>Data Value</displayName>
              <description>Transmit or receive data value. Reading this register returns the received data. Writing to this register sends data. If parity is enabled and using 9 data bits, bit 8 is the parity bit. If parity is enabled and using 8 data bits, bit 7 is the parity bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
              </vendorExtensions>
            </field>
          </fields>
        </register>
