Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/chip_config.svd
        <register>
          <name>GTPSC</name>
          <displayName>GTPSC</displayName>
          <description>Guard time and prescaler register. Cannot be used for UART4 and UART5.</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <protection>n</protection>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PSC</name>
              <displayName>Prescaler Factor</displayName>
              <description>Divides the system clock to provide the clock for IR or Smart Card mode. - In IR low-power mode, PSC[7:0] can be 1..255 (0 is reserved). - In IR normal mode, PSC must be 1. - In Smart Card mode, PSC[4:0] is significant (0 is reserved; a nonzero value corresponds to 2x(PSC[4:0]) prescaler, e.g. 1 =&gt; 2, 2 =&gt; 4, etc.).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
              </vendorExtensions>
            </field>
            <field>
              <name>GRDT</name>
              <displayName>Guard Time Value</displayName>
              <description>Sets the guard time (in baud clock cycles). In Smart Card mode, this delays TXCFLG until the guard time finishes. 0 means no additional guard time; up to 255 for the maximum delay.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <vendorExtensions>
                <embeetle:fieldKind>setting</embeetle:fieldKind>
              </vendorExtensions>
            </field>
          </fields>
        </register>
        <register>
          <name>STS</name>
          <displayName>STS</displayName>
          <description>Status register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <protection>n</protection>
          <resetValue>0xC0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PEFLG</name>
              <displayName>Parity Error Flag</displayName>
              <description>Set by hardware in receive mode when a parity error is detected. Clear by software, after setting of RXBNEFLG, first read USART_STS and then read USART_DATA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_PARITY_ERROR</name>
                  <description>No parity error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PARITY_ERROR</name>
                  <description>Parity check error occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
              </vendorExtensions>
            </field>
            <field>
              <name>FEFLG</name>
              <displayName>Frame Error Flag</displayName>
              <description>Set by hardware if stop bit is missing, too much noise, or on break symbol. Cleared by reading USART_STS and then reading USART_DATA.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FRAME_ERROR</name>
                  <description>No frame error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAME_ERROR</name>
                  <description>Frame error or break detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
              </vendorExtensions>
            </field>
            <field>
              <name>NEFLG</name>
              <displayName>Noise Error Flag</displayName>
              <description>Set by hardware when noise is detected during reception. Cleared by reading USART_STS and then reading USART_DATA.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_NOISE_ERROR</name>
                  <description>No noise error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOISE_ERROR</name>
                  <description>Noise error detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
              </vendorExtensions>
            </field>
            <field>
              <name>OVREFLG</name>
              <displayName>Overrun Error Flag</displayName>
              <description>Set by hardware when new data arrives while RXBNEFLG=1 (which means the receive data buffer is full). Cleared by reading USART_STS and then reading USART_DATA.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_OVERRUN</name>
                  <description>No overrun error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVERRUN_ERROR</name>
                  <description>Overrun error occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
              </vendorExtensions>
            </field>
            <field>
              <name>IDLEFLG</name>
              <displayName>Idle Line Detected Flag</displayName>
              <description>Set by hardware when an idle bus is detected. Cleared by reading USART_STS and then reading USART_DATA.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_IDLE_LINE</name>
                  <description>No idle line detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLE_DETECTED</name>
                  <description>Idle line detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
              </vendorExtensions>
            </field>
            <field>
              <name>RXBNEFLG</name>
              <displayName>Receive Buffer Not Empty Flag</displayName>
              <description>Set by hardware when data is transferred from shift register to DATA. Cleared by reading DATA or by writing 0 to this bit.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUFFER_EMPTY</name>
                  <description>Receive buffer empty</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUFFER_NOT_EMPTY</name>
                  <description>Receive buffer contains data</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
              </vendorExtensions>
            </field>
            <field>
              <name>TXCFLG</name>
              <displayName>Transmission Complete Flag</displayName>
              <description>Set by hardware after the last frame is transmitted and TXBEFLG=1 (which means the Transmit Buffer is empty). Cleared by reading USART_STS, then writing 0 to this bit, or by writing DATA.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_COMPLETE</name>
                  <description>Transmission not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETE</name>
                  <description>Last frame transmission complete</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
              </vendorExtensions>
            </field>
            <field>
              <name>TXBEFLG</name>
              <displayName>Transmit Buffer Empty Flag</displayName>
              <description>Set by hardware when the shift register has loaded data from DATA register. Cleared by writing to DATA register.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUFFER_NOT_EMPTY</name>
                  <description>TX buffer not empty</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUFFER_EMPTY</name>
                  <description>TX buffer empty</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
              </vendorExtensions>
            </field>
            <field>
              <name>LBDFLG</name>
              <displayName>LIN Break Detected Flag</displayName>
              <description>Set by hardware when a LIN break is detected. Cleared by writing 0 to this bit.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_LIN_BREAK</name>
                  <description>No LIN break detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LIN_BREAK_DETECTED</name>
                  <description>LIN break detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
              </vendorExtensions>
            </field>
            <field>
              <name>CTSFLG</name>
              <displayName>CTS Change Flag</displayName>
              <description>Set by hardware when CTS flow control is enabled (see CTSEN bitfield from CTRL3 register) and the nCTS pin toggles. Cleared by writing 0 to this bit.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CHANGE</name>
                  <description>No change in CTS line</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTS_CHANGED</name>
                  <description>CTS line changed</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <vendorExtensions>
                <embeetle:fieldKind>runtime</embeetle:fieldKind>
              </vendorExtensions>
            </field>
          </fields>
        </register>
