Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/chip_config.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CoreDebug</name>
      <description>Core Debug Registers</description>
      <groupName>CoreDebug</groupName>
      <baseAddress>0xE000EDF0</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
        <protection>s</protection>
      </addressBlock>
      <registers>
        <register>
          <name>DHCSR</name>
          <description>Debug Halting Control and Status Register</description>
          <addressOffset>0x000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF01FF</resetMask>
          <fields>
            <field>
              <name>C_DEBUGEN</name>
              <description>Debug enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C_HALT</name>
              <description>Processor halt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C_STEP</name>
              <description>Step the core</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C_MASKINTS</name>
              <description>Mask interrupts when halted</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C_SNAPSTALL</name>
              <description>Snap stall</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>S_REGRDY</name>
              <description>Register Ready</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBGKEY</name>
              <description>Debug key</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>S_HALT</name>
              <description>Indicates processor is halted</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>S_SLEEP</name>
              <description>Indicates processor is sleeping</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>S_LOCKUP</name>
              <description>Indicates processor is in lockup state</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>S_RETIRE_ST</name>
              <description>Indicates a debug instruction retired</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>S_RESET_ST</name>
              <description>Indicates a system reset occurred</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DCRSR</name>
          <description>Debug Core Register Selector Register</description>
          <addressOffset>0x004</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0001FFFF</resetMask>
          <fields>
            <field>
              <name>REGSEL</name>
              <description>Specifies the core register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>REGWnR</name>
              <description>Write or read the core register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DCRDR</name>
          <description>Debug Core Register Data Register</description>
          <addressOffset>0x008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DEMCR</name>
          <description>Debug Exception and Monitor Control Register</description>
          <addressOffset>0x00C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x010F1FFF</resetMask>
          <fields>
            <field>
              <name>VC_CORERESET</name>
              <description>Enable vector catch for core reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VC_MMERR</name>
              <description>Enable vector catch for memory management faults</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VC_NOCPERR</name>
              <description>Enable vector catch for coprocessor access faults</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VC_CHKERR</name>
              <description>Enable vector catch for check errors</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VC_STATERR</name>
              <description>Enable vector catch for state errors</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VC_BUSERR</name>
              <description>Enable vector catch for bus faults</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VC_INTERR</name>
              <description>Enable vector catch for interrupt errors</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VC_HARDERR</name>
              <description>Enable vector catch for hard faults</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MON_EN</name>
              <description>Enable DebugMonitor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MON_PEND</name>
              <description>Indicates if DebugMonitor is pending</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MON_STEP</name>
              <description>Step DebugMonitor</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MON_REQ</name>
              <description>Generate DebugMonitor exception</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRCENA</name>
              <description>Enable trace and debug blocks</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
